
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ПараметрыОткрытия", ПараметрыОткрытия);
	
	ОсновнаяОрганизация   = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	ОсновноеПодразделение = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");
	ОсновнойСклад         = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");
	
	ПоказыватьСчетаУчетаВДокументах = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ПоказыватьСчетаУчетаВДокументах");
	Элементы.ПоказыватьСчетаУчетаВДокументах.Видимость = СчетаУчетаВДокументах.ПравоПросмотраСчетовУчета();
	
	Элементы.НастройкаСинхронизацииСКалендаремGoogle.Видимость = СинхронизацияСКалендаремGoogle.ДоступнаНастройкаСинхронизации();
	
	ЗапрашиватьПодтверждениеПриЗавершенииПрограммы = СтандартныеПодсистемыСервер.ЗапрашиватьПодтверждениеПриЗавершенииПрограммы();
	ЗначениеРабочейДаты = ОбщегоНазначения.РабочаяДатаПользователя();
	
	ТекущаяОрганизация                             = ОсновнаяОрганизация;
	ТекущееПодразделение                           = ОсновноеПодразделение;
	ТекущийСклад                                   = ОсновнойСклад;
	ТекущееЗначениеПоказыватьСчетаУчетаВДокументах = ПоказыватьСчетаУчетаВДокументах;
	
	// Квартплата +
	НеИспользоватьФункционалЖКХ          = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("НеИспользоватьФункционалЖКХ");
	ОсновнаяСтавкаНДС                    = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяСтавкаНДС");
	ОсновнойВидОперацииРегистрацияОплаты = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнойВидОперацииРегистрацияОплаты");
	
	Элементы.ОсновнаяСтавкаНДС.РежимВыбораИзСписка = Истина;
	Элементы.ОсновнаяСтавкаНДС.СписокВыбора.Очистить();
	
	Если ОбщегоНазначения.ТекущаяДатаПользователя() > '20190101' Тогда
		
		Если ОсновнаяСтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
			ОсновнаяСтавкаНДС = Перечисления.СтавкиНДС.НДС20;
		ИначеЕсли ОсновнаяСтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
			ОсновнаяСтавкаНДС = Перечисления.СтавкиНДС.НДС20_120;
		КонецЕсли;
		
		Для Каждого ЗначениеПеречисления Из Перечисления.СтавкиНДС Цикл
			
			Если ЗначениеПеречисления = Перечисления.СтавкиНДС.НДС18
				 Или ЗначениеПеречисления = Перечисления.СтавкиНДС.НДС18_118 Тогда
				Продолжить;
			КонецЕсли;
			
			Элементы.ОсновнаяСтавкаНДС.СписокВыбора.Добавить(ЗначениеПеречисления);
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого ЗначениеПеречисления Из Перечисления.СтавкиНДС Цикл
			
			Если ЗначениеПеречисления = Перечисления.СтавкиНДС.НДС20
				 Или ЗначениеПеречисления = Перечисления.СтавкиНДС.НДС20_120 Тогда
				Продолжить;
			КонецЕсли;
			
			Элементы.ОсновнаяСтавкаНДС.СписокВыбора.Добавить(ЗначениеПеречисления);
			
		КонецЦикла;
		
	КонецЕсли;
	// Квартплата -
	
	Если ЗначениеЗаполнено(ЗначениеРабочейДаты) Тогда
		ИспользоватьТекущуюДатуКомпьютера = 1;
	Иначе
		ИспользоватьТекущуюДатуКомпьютера = 0;
		ЗначениеРабочейДаты = '0001-01-01';
	КонецЕсли;
	
	ТолькоПросмотр = Не ПравоДоступа("СохранениеДанныхПользователя", Метаданные);
	
	// СтандартныеПодсистемы.РаботаСФайлами
	
	ЭтоВебКлиент = ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент();
	
	Если ЭтоВебКлиент Или Не ОбщегоНазначенияКлиентСервер.ЭтоWindowsКлиент() Тогда
		Элементы.НастройкаСканирования.Видимость = Ложь;
	КонецЕсли;
	
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	УправлениеФормой(ЭтаФорма);
	
	// СтандартныеПодсистемы.Пользователи
	АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
	// Конец СтандартныеПодсистемы.Пользователи
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановленАктивныйЭлемент = Ложь;
	
	Если ТипЗнч(ПараметрыОткрытия) = Тип("Структура") Тогда

		АктивныйЭлемент = Неопределено;
		ПараметрыОткрытия.Свойство("АктивныйЭлемент", АктивныйЭлемент);

		Если ТипЗнч(АктивныйЭлемент) = Тип("Строка") Тогда
			ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Найти(АктивныйЭлемент);
			УстановленАктивныйЭлемент = Истина;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	КорректныйПериод = ОбщегоНазначенияБПСобытия.КорректныйПериодВводаДокументов();
	
	РабочаяДатаУказываетсяПользователем = ИспользоватьТекущуюДатуКомпьютера = 1;
	
	Если РабочаяДатаУказываетсяПользователем Тогда
		Если ЗначениеРабочейДаты < КорректныйПериод.НачалоКорректногоПериода Тогда
			ГраницаКорректности = Формат(КорректныйПериод.НачалоКорректногоПериода, "ДФ=гггг");
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Рабочая дата должна быть не ранее %1 года'"), ГраницаКорректности);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ЗначениеРабочейДаты",, Отказ);
		ИначеЕсли ЗначениеРабочейДаты > КорректныйПериод.КонецКорректногоПериода Тогда
			ГраницаКорректности = Формат(КорректныйПериод.КонецКорректногоПериода, "ДФ=гггг");
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Рабочая дата должна быть не позже %1 года'"), ГраницаКорректности);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ЗначениеРабочейДаты",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Модифицированность Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Данные были изменены. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АвторизованныйПользовательНажатие(Элемент, СтандартнаяОбработка)
	
	ПоказатьЗначение(, АвторизованныйПользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТекущуюДатуКомпьютераПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
	Если ИспользоватьТекущуюДатуКомпьютера = 0 Тогда
		ЗначениеРабочейДаты = '0001-01-01';
	ИначеЕсли ИспользоватьТекущуюДатуКомпьютера = 1 Тогда
		ЗначениеРабочейДаты = ТекущаяДата();
	КонецЕсли;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОсновноеПодразделениеПриИзменении(Элемент)

	ПриИзмененииПодразделенияСервер();

КонецПроцедуры

&НаКлиенте
Процедура НастройкаСинхронизацииСКалендаремGoogle(Команда)
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуНастройкиСинхронизацииСКалендаремGoogle();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть()
	
	Если ЗаписатьДанные() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСканирования(Команда)
	
	РаботаСФайламиКлиент.ОткрытьФормуНастройкиСканирования();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройкиСервер()
	
	Настройки = Новый Структура;
	Настройки.Вставить("ЗапрашиватьПодтверждениеПриЗавершенииПрограммы", ЗапрашиватьПодтверждениеПриЗавершенииПрограммы);
	ОбщегоНазначения.СохранитьПерсональныеНастройки(Настройки);
	
	ОбщегоНазначенияБПВызовСервера.УстановитьЗначениеПоУмолчанию("ОсновнаяОрганизация",              ОсновнаяОрганизация);
	ОбщегоНазначенияБПВызовСервера.УстановитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации", ОсновноеПодразделение);
	ОбщегоНазначенияБПВызовСервера.УстановитьЗначениеПоУмолчанию("ОсновнойСклад",                    ОсновнойСклад);
	ОбщегоНазначенияБПВызовСервера.УстановитьЗначениеПоУмолчанию("ПоказыватьСчетаУчетаВДокументах",  ПоказыватьСчетаУчетаВДокументах);
	
	// Квартплата +
	ОбщегоНазначенияБПВызовСервера.УстановитьЗначениеПоУмолчанию("НеИспользоватьФункционалЖКХ",          НеИспользоватьФункционалЖКХ);
	ОбщегоНазначенияБПВызовСервера.УстановитьЗначениеПоУмолчанию("ОсновнаяСтавкаНДС",                    ОсновнаяСтавкаНДС);
	ОбщегоНазначенияБПВызовСервера.УстановитьЗначениеПоУмолчанию("ОсновнойВидОперацииРегистрацияОплаты", ОсновнойВидОперацииРегистрацияОплаты);
	// Квартплата -
	
	Если ИспользоватьТекущуюДатуКомпьютера = 0 Тогда
		ЗначениеРабочейДатыДляСохранения  = '0001-01-01';
	Иначе
		ЗначениеРабочейДатыДляСохранения  = ЗначениеРабочейДаты;
	КонецЕсли;
	ОбщегоНазначения.УстановитьРабочуюДатуПользователя(ЗначениеРабочейДатыДляСохранения);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПодразделенияСервер()

	Если НЕ ОсновноеПодразделение.Пустая() Тогда
		ОрганизацияПодразделения = БухгалтерскийУчетПереопределяемый.ОрганизацияПодразделения(ОсновноеПодразделение);
		Если ЗначениеЗаполнено(ОрганизацияПодразделения) 
			И ОрганизацияПодразделения <> ОсновнаяОрганизация Тогда
			ОсновнаяОрганизация = ОрганизацияПодразделения;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ЗаписатьДанные()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Настройки = Новый Структура;
	Настройки.Вставить("ЗапрашиватьПодтверждениеПриЗавершенииПрограммы", ЗапрашиватьПодтверждениеПриЗавершенииПрограммы);
	ОбщегоНазначенияКлиент.СохранитьПерсональныеНастройки(Настройки);
	
	СохранитьНастройкиСервер();
	
	Если ТекущаяОрганизация <> ОсновнаяОрганизация Тогда
		Оповестить("ИзменениеОсновнойОрганизации", ОсновнаяОрганизация);
	КонецЕсли;
	ТекущаяОрганизация = ОсновнаяОрганизация;
	
	Если ТекущееПодразделение <> ОсновноеПодразделение Тогда
		Оповестить("ИзменениеОсновногоПодразделенияОрганизации", ОсновноеПодразделение);
	КонецЕсли;
	ТекущееПодразделение = ОсновноеПодразделение;
	
	Если ТекущийСклад <> ОсновнойСклад Тогда
		Оповестить("ИзменениеОсновногоСклада", ОсновнойСклад);
	КонецЕсли;
	ТекущийСклад = ОсновнойСклад;
	
	Если ТекущееЗначениеПоказыватьСчетаУчетаВДокументах <> ПоказыватьСчетаУчетаВДокументах Тогда
		Оповестить("ИзменениеПоказыватьСчетаУчетаВДокументах", ПоказыватьСчетаУчетаВДокументах);
	КонецЕсли;
	ТекущееЗначениеПоказыватьСчетаУчетаВДокументах = ПоказыватьСчетаУчетаВДокументах;
	
	Модифицированность = Ложь;
	
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	
	Возврат Истина;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Форма.Элементы.ЗначениеРабочейДаты.Доступность  = Форма.ИспользоватьТекущуюДатуКомпьютера = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьИЗакрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
