#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПараметрыДоступныхОрганизаций() Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.НастройкиСистемыНалогообложения) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации",
		УправлениеДоступомБП.ОрганизацииДанныеКоторыхДоступныПользователю("РегистрБухгалтерии.Хозрасчетный"));
	Запрос.УстановитьПараметр("НаДату", ОбщегоНазначения.ТекущаяДатаПользователя());
	Запрос.УстановитьПараметр("ТекстОСНО", НСтр("ru='ОСНО'"));
	Запрос.УстановитьПараметр("ТекстУСН", НСтр("ru='УСН'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|			ТОГДА &ТекстОСНО
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная)
	|			ТОГДА &ТекстУСН
	|	КОНЕЦ КАК ТекущийРежим,
	|	НастройкиСистемыНалогообложенияСрезПоследних.Организация,
	|	НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения
	|ИЗ
	|	РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних(
	|			&НаДату,
	|			Организация В (&Организации)
	|				И СистемаНалогообложения <> ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ОсобыйПорядок)) КАК НастройкиСистемыНалогообложенияСрезПоследних";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли

