
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ТипОбъекта",     "ОбщийМодуль");
	ПараметрыОбработчика.Вставить("ИмяОбъекта",     "УчетЗарплаты");
	ПараметрыОбработчика.Вставить("ИмяОбработчика", "ПечатьЧековНаУдержанияИзЗарплаты");
	ПараметрыОбработчика.Вставить("ГрупповаяПечать", Истина);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЧековЗавершение", ЭтотОбъект, Новый Структура("Форма, ПараметрыОбработчика", ПараметрыВыполненияКоманды.Источник, ПараметрыОбработчика));
	
	ПечатьФискальныхДокументовКлиент.НапечататьЧеки(ПараметрыВыполненияКоманды.Источник, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧековЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат.СообщениеОбОшибке) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры 
