
////////////////////////////////////////////////////////////////////////////////
// Универсальные методы для формы записи регистра и формы настройки налогов
//
// Клиент-серверные методы формы записи регистра сведений НастройкиУчетаНалогаНаПрибыль
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура УправлениеФормой(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Запись   = Форма.НастройкиУчетаНалогаНаПрибыль;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СтавкиНалогаНаПрибыльВБюджетСубъектовРФ",
		"Доступность",
		Запись.ПрименяютсяРазныеСтавкиНалогаНаПрибыль);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"БазаРаспределенияКосвенныхРасходовПоВидамДеятельности",
		"Видимость",
		Форма.ПлательщикЕНВД);
		
	Форма.ПорядокПодачиДекларации = ?(Запись.УплачиватьНалогПоГруппамОбособленныхПодразделений, 1, 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"НалоговыеОрганыГруппОбособленныхПодразделений",
		"Доступность",
		Запись.УплачиватьНалогПоГруппамОбособленныхПодразделений);
		
КонецПроцедуры

#КонецОбласти