#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Открывает форму списка регистра "Услуги общедомового счетчика" с отбором по услуге.
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Услуга", ПараметрКоманды);
	
	ОткрытьФорму("РегистрСведений.УПЖКХ_УслугиОбщедомовогоСчетчика.ФормаСписка", ПараметрыФормы,
				 ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
				 ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти