////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен с банками по зарплатным проектам".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Определяет возможность передачи ведомости в банк самостоятельно или ведомость отправляется в банк в составе платежного документа.
//
// Возвращаемое значение:
//		Булево - Истина, если ведомость может быть самостоятельно отправлена в банк,
//				Ложь, если ведомость отправляется в банк только в составе платежного документа
//
Функция РазрешенаОтправкаОтдельнойВедомости() Экспорт
	
	Использование = Истина;
	
	ОбменСБанкамиПоЗарплатнымПроектамПереопределяемый.ОпределитьДоступностьПередачиВБанкРеестровНаЗачислениеЗарплаты(Использование);
	
	Если Не Использование Тогда
		Возврат Использование;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("КонфигурацииЗарплатаКадрыРасширенный");
		Модуль.РазрешитьОтправкуВБанкОтдельнойВедомости(Использование);
	КонецЕсли;
	
	Возврат Использование;
	
КонецФункции

#КонецОбласти

