Процедура ОпределитьПоддержкуУчетаПоЭлементамЗатрат(УчетПоддерживается) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеСчетаРасходов(СчетаРасходов) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыУчета(ПараметрыУчета) Экспорт
	
КонецПроцедуры

Процедура ОпределитьВидСубконтоПоимениПараметра(ВидСубконто, ИмяПараметра) Экспорт
	
КонецПроцедуры

Процедура ОпределитьВидСубконтоЭлементыЗатрат(ВидСубконто) Экспорт
	
КонецПроцедуры

Процедура ДобавитьВариантСтруктурыЗатрат(ВариантыСтруктурыЗатрат, Период, Организация, ОценитьЗапасы, ОписаниеСумм) Экспорт
	
КонецПроцедуры

Процедура СоздатьСтруктуруСтоимостиЗапасов(МенеджерВременныхТаблиц, Период, Организация, ВариантыСтруктурыЗатрат) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыФормированияПроводок(ПараметрыПроводок, ВариантыСтруктурыЗатрат, КлючиСтруктурыЗатрат, ОписаниеСуммПроводок) Экспорт
	
КонецПроцедуры

Процедура ДобавитьПроводки(Проводки, СводнаяПроводка, Суммы, ПараметрыФормированияПроводок) Экспорт
	
КонецПроцедуры

Процедура ДополнитьРезультат(Результат, Протокол, ОписаниеСумм, МенеджерВременныхТаблиц, Организация, ВариантыСтруктурыЗатрат) Экспорт
	
КонецПроцедуры

Процедура СформироватьДвиженияСтруктураСтоимостиЗапасов(РезультатРасчета, Движения, Период, Организация) Экспорт
	
КонецПроцедуры

Процедура СформироватьДвиженияСтруктураСтоимостиЗапасовПриВводеНачальныхОстатков(ДанныеДокумента, Движения, Период, Организация, Подразделение) Экспорт
	
КонецПроцедуры

