
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием(ПараметрыВыполненияКоманды);
	ПараметрыОткрытия.Заголовок               = НСтр("ru = 'Счета от поставщиков'");
	ПараметрыОткрытия.ИмяФормы                = "Документ.СчетНаОплатуПоставщика.ФормаСписка";
	ПараметрыОткрытия.ЗамерПроизводительности = "СозданиеФормыСпискаСчетНаОплатуПоставщика";
	// Не связываем форму списка с навигационной ссылкой команды, 
	// чтобы не смущать пользователя словами про оценку производительности в тексте ссылки, 
	// который могут пересылать другим пользователям.
	ПараметрыОткрытия.НавигационнаяСсылка     = Неопределено;

	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия);

КонецПроцедуры
