
#Область ГрупповоеПерепроведениеДокументов

// Создает реквизит формы и элемент формы в обработках "Групповое перепроведение документов" и "Закрытие месяца".
Процедура СоздатьРеквизитИЭлементыФормыПерепроводитьДокументыПодсистемыЖКХ(Форма, Родитель) Экспорт
	
	НовыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("ПерепроводитьДокументыПодсистемыЖКХ", Новый ОписаниеТипов("Булево"));
	НовыеРеквизиты.Добавить(НовыйРеквизит);
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);
	
	Элемент = Форма.Элементы.Добавить("ПерепроводитьДокументыПодсистемыЖКХ", Тип("ПолеФормы"), Родитель);
	Элемент.Заголовок = "Перепроводить документы подсистемы ЖКХ";
	Элемент.Вид = ВидПоляФормы.ПолеФлажка;
	Элемент.ПутьКДанным = "ПерепроводитьДокументыПодсистемыЖКХ";
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	Элемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	
	ТекстПодсказки = "Документы подсистемы ЖКХ будут перепроведены вместе " +
					 "с бухгалтерскими документами." + Символы.ПС + "По умолчанию документы подсистемы ЖКХ " +
					 "не участвуют в перепроведении документов за выбранный период.";
	Элемент.Подсказка = ТекстПодсказки;
	
КонецПроцедуры

#КонецОбласти
