
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик "ПриСозданииНаСервере" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура") И Параметры.Свойство("ЗаголовокФормы") И Параметры.Свойство("АдресСтраницы") Тогда
		ЭтаФорма.Заголовок = Параметры.ЗаголовокФормы;
		АдресСтраницы      = Параметры.АдресСтраницы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик "ПриОткрытии" формы.
//
Процедура ПриОткрытии(Отказ)
	
	Если АдресСтраницы = "" Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти