
#Область ПрочиеПроцедурыИФункции

Функция КонтрольнаяСтрокаСовпадает()
	
	КонтрольнаяСтрока = "Самостоятельное изменение константы ""Дата начала использования нового механизма отражения " +
		"начислений в регл. учете"" крайне не рекомендуется поставщиком программы, так как может повлечь серьезные " +
		"и необратимые изменения в ведении учета. За дополнительной информацией обратитесь к разработчикам программы.";
	
	Если ДополнительныеСвойства.Свойство("КонтрольнаяСтрока")
		И ДополнительныеСвойства.КонтрольнаяСтрока = КонтрольнаяСтрока Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ТекущееЗначение = Константы.УПЖКХ_ДатаНачалаИспользованияНовогоМеханизмаОтраженияНачисленийВРеглУчете.Получить();
	
	Если Не Значение = ТекущееЗначение
		И Не КонтрольнаяСтрокаСовпадает() Тогда
		
		ТекстСообщения = "Редактирование константы ""Дата начала использования нового механизма " +
						"отражения начислений в регл. учете"" запрещено.";
		УПЖКХ_ТиповыеМетодыКлиентСервер.СообщитьОбОшибке(ТекстСообщения, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
