#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение сведений.
Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьВычетыПоДоходамНДФЛ();
	
КонецПроцедуры

// Выполняет заполнение справочника "ВидыДоходовНДФЛ".
//
Процедура ЗаполнитьВычетыПоДоходамНДФЛ()
	
	ВидыДоходовНДФЛ = Справочники.ВидыДоходовНДФЛ;
	
	// РАЗМЕРЫ СКИДОК К ДОХОДАМ
	
	НаборЗаписей = РегистрыСведений.ВычетыПоДоходамНДФЛ.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	
	ДатаСведений = '20100101';
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код1211, 12000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2201, 0,	 20);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2202, 0,	 30);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2203, 0,	 40);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2204, 0,	 30);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2205, 0,	 40);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2206, 0,	 25);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2207, 0,	 20);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2208, 0,	 20);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2209, 0,	 30);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2720, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2730, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2740, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2760, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2761, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2762, 0, 50000);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2770, 4000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2790, 10000, 0);
	ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, ВидыДоходовНДФЛ.Код2791, 0, 4300);
	
	// Запишем набор записей в режиме добавления.
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры 

// Добавляет запись в набор записей регистра "ВычетыПоДоходамНДФЛ".
//
Процедура ДобавитьСкидкуКДоходамНДФЛ(НаборЗаписей, ДатаСведений, КодДохода, ГодовойВычет, НормативЗатрат) 

	НоваяЗапись = НаборЗаписей.Добавить();

	НоваяЗапись.Период         = ДатаСведений;
	НоваяЗапись.КодДохода      = КодДохода;
	НоваяЗапись.ГодовойВычет   = ГодовойВычет;
	НоваяЗапись.НормативЗатрат = НормативЗатрат;

КонецПроцедуры

#КонецОбласти

#КонецЕсли