
// Возвращает адрес хранилища файла с текстовым документом,
// содержащим настройки программы
// Возвращаемое значение:
//	 АдресВременногоХранилища - Строка - Адрес хранилища сформированного файла
//
// Параметры
// ПараметрыНастройкиПрограммы - Структура - Структура, содержащая ключи:
//								Организация - Организация, по которой будет получена учетная политика
//								Уникальный идентификатор - УникальныйИдентификатор
//
Функция ПолучитьДанныеДляОбращенияВТехническуюПоддержку(ПараметрыАвтоВложений, АдресРезультата) Экспорт
	
	// Пока нет итогового списка с информацией для ЛК используем стандартный документ.
	УстановитьПривилегированныйРежим(Истина);
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Обработки.ОбращениеВТехническуюПоддержку.НастройкиПрограммы(ПараметрыАвтоВложений));
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, АдресРезультата);
	
КонецФункции