////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("КлючНастроек", КлючНастроек);
	
	Обработка = РеквизитФормыВЗначение("Объект");
	
	МетаданныеОбработки = Обработка.Метаданные();
	
	Если ПолучитьФункциональнуюОпцию("ИнтерфейсВерсия82")
		И МетаданныеОбработки.Макеты.Найти(КлючНастроек + "_82") <> Неопределено Тогда
		
		Макет = Обработка.ПолучитьМакет(КлючНастроек + "_82");
		
	ИначеЕсли МетаданныеОбработки.Макеты.Найти(КлючНастроек) <> Неопределено Тогда
		
		Макет = Обработка.ПолучитьМакет(КлючНастроек);
		
	Иначе
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	ТекстПредупреждения = Макет.ПолучитьТекст();
	Заголовок = ?(Найти(КлючНастроек,"БыстроеОсвоение") > 0, НСтр("ru = 'Быстрое освоение'"), НСтр("ru = 'Внимание!'"));
	
	Если НЕ ПустаяСтрока(КлючНастроек) Тогда
		   //неразрешимая ссылка при обнове.

		//БольшеНеПоказывать = ХранилищеОбщихНастроек.Загрузить("Обработка.ПредупреждениеОбИзменениях", КлючНастроек);
		//
		//Если БольшеНеПоказывать <> Неопределено И БольшеНеПоказывать Тогда
		//	Отказ = Истина;
		//КонецЕсли;
		
	Иначе
		Элементы.КнопкаБольшеНеПоказывать.Видимость	= Ложь;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ТектсПредупрежденияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Ссылка = ДанныеСобытия.Href;
	Если НЕ ПустаяСтрока(Ссылка) Тогда
		// Сначала проверяем особые случаи
		Если Найти(Ссылка, "ПанельАдминистрированияБПИнтерфейс") Тогда
			ОткрытьФорму("Обработка.ПанельАдминистрированияБП.Форма.Интерфейс");
		ИначеЕсли Найти(Ссылка, "ПерсональныеНастройки") Тогда
			// Отметим, чтобы предупреждение об изменениях не показывалось второй раз
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("ПоказыватьПредупреждениеОбИзменениях", Ложь);
			
			ОткрытьФорму("ОбщаяФорма.ПерсональныеНастройки", ПараметрыФормы);
		ИначеЕсли Найти(Ссылка, "РегистрыБУСубъектовМалогоПредпринимательства") Тогда
			// Отметим, чтобы предупреждение об изменениях не показывалось второй раз
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("ПоказыватьПредупреждениеОбИзменениях", Ложь);
			
			ФормаРегистров = ПолучитьФорму("Отчет.РегистрыБУСубъектовМалогоПредпринимательства.Форма", Новый Структура("КлючВарианта", "ВедомостьУчетаРасчетовИПрочихОпераций"));
			ФормаРегистров.ОткрытьСправкуФормы();
			
		ИначеЕсли Найти(Ссылка, "ПараметрыУчета") Тогда
			
			МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Ссылка, "#");
			ИмяЗакладки = ?(МассивПодстрок.Количество() < 2, "", МассивПодстрок[МассивПодстрок.ВГраница()]);
			
			ФормаНастройки = ПолучитьФорму("ОбщаяФорма.ПараметрыУчета");
			Если НЕ ПустаяСтрока(ИмяЗакладки) Тогда
				ФормаНастройки.Элементы.ГруппаСтраницы.ТекущаяСтраница = ФормаНастройки.Элементы[ИмяЗакладки];
				ФормаНастройки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
			КонецЕсли;
			ФормаНастройки.Открыть();
			
		Иначе
			ПерейтиПоНавигационнойСсылке(Ссылка);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Процедура СохранитьЗначениеБольшеНеПоказыватьНаСервере(КлючНастроек, БольшеНеПоказывать)
	 //неразрешимая ссылка при обнове.

	//ХранилищеОбщихНастроек.Сохранить("Обработка.ПредупреждениеОбИзменениях", КлючНастроек, БольшеНеПоказывать);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура НажатиеБольшеНеПоказывать(Команда)
	
	Если НЕ ПустаяСтрока(КлючНастроек) Тогда
		
		СохранитьЗначениеБольшеНеПоказыватьНаСервере(КлючНастроек, Истина);
		
	КонецЕсли;
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура НажатиеПоказатьПозже(Команда)
	
	Закрыть();
	
КонецПроцедуры

