
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события "ПриСозданииНаСервере".
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.СпособРасчета) Тогда
		УПЖКХ_ТиповыеМетодыКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "СпособРасчета", Параметры.СпособРасчета,
		                             ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Параметры.СпособРасчета));
	КонецЕсли;
	
	ТекОтбор = Неопределено;
	Если Параметры.Отбор.Свойство("СпособРасчета", ТекОтбор) Тогда
		Если ТипЗнч(ТекОтбор) = Тип("СписокЗначений") Тогда
			УПЖКХ_ТиповыеМетодыКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "СпособРасчета", ТекОтбор,
																	ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		Иначе
			УПЖКХ_ТиповыеМетодыКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "СпособРасчета", ТекОтбор,
																	ВидСравненияКомпоновкиДанных.Равно, , Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоГруппа") Тогда
		Если ЗначениеЗаполнено(Параметры.ЭтоГруппа) Тогда
			УПЖКХ_ТиповыеМетодыКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ЭтоГруппа", Параметры.ЭтоГруппа,
			                             ВидСравненияКомпоновкиДанных.Равно, , Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Обработчик события "ПриОткрытии".
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.ОтображатьСписком Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	
	// Установим текущую строку дерева, если она не спозиционирована.
	// Необходимо для позиционирования текущей строки списка услуг.
	Если Элементы.Дерево.ТекущаяСтрока = Неопределено Тогда
		Элементы.Дерево.ТекущаяСтрока = ПредопределенноеЗначение("Справочник.КВП_Услуги.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
