
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоАдресВременногоХранилища(Параметры.АдресХранилищаОписаниеОшибок) Тогда 
		ВызватьИсключение НСтр("ru = 'Не указан адрес временного хранилища с описанием ошибок'");
	КонецЕсли;
	
	ВсяТаблицаОшибок = ПолучитьИзВременногоХранилища(Параметры.АдресХранилищаОписаниеОшибок);
	ОтборПоКонтексту = Новый Структура("Контекст", Параметры.Контекст);
	ОшибкиПоКонтексту = ВсяТаблицаОшибок.Скопировать(ОтборПоКонтексту);
	
	ТаблицаОшибок.Загрузить(ОшибкиПоКонтексту);
	
	Если Параметры.Контекст = Перечисления.ТипыЗапросовРеестровСчетовФактур.ЗапросПоставщику Тогда
		Заголовок = НСтр("ru='Ошибки при получении реестров от поставщиков'");
		Элементы.КнопкаСправка.Заголовок = НСтр("ru='Как исправить ошибки и загрузить реестры?'");
		
	ИначеЕсли Параметры.Контекст = Перечисления.ТипыЗапросовРеестровСчетовФактур.ЗапросПокупателя Тогда
		Заголовок = НСтр("ru='Ошибки при получении запросов от покупателей'");
		Элементы.КнопкаСправка.Заголовок = НСтр("ru='Как исправить ошибки и ответить на запросы?'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
