
// Модуль предназначен для использования повторных вызовов, сохраняя возвращаемое значение в кэш программы.
// Возвращаемые значения хранятся в кэше на сервере в течении одного сеанса.

// Здесь приведен пример обработчиков для ЖКХ 3.0.

#Область СлужебныеПроцедурыИФункции

#Область Получение_данных_из_базы

// Проверяет необходимость вывода рекламы по параметрам информационной базы.
// 
// Возвращаемое значение:
//  Булево.
//
Функция ВыводитьРекламуСогласноПараметрамБазы() Экспорт
	
	Возврат ОТР_РекламаСерверПереопределяемый.ВыводитьРекламуСогласноПараметрамБазы();
	
КонецФункции // ВыводитьРекламуСогласноПараметрамБазы()

// Получает структуру настроек размещения баннеров на формах программы.
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьНастройкиРазмещенияБаннеров() Экспорт
	
	Возврат ОТР_РекламаСерверПереопределяемый.ПолучитьНастройкиРазмещенияБаннеров();
	
КонецФункции // ПолучитьНастройкиРазмещенияБаннеров()

#КонецОбласти // Получение_данных_из_базы

#Область Получение_дополнительных_параметров

// Получает пустую таблицу настроек пользователя.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица, см. "ОТР_РекламаСерверПереопределяемый.ПолучитьПустуюТаблицуНастроекПользователя()".
//
Функция ПолучитьПустуюТаблицуНастроекПользователя() Экспорт
	
	Возврат ОТР_РекламаСерверПереопределяемый.ПолучитьПустуюТаблицуНастроекПользователя();
	
КонецФункции // ПолучитьПустуюТаблицуНастроекПользователя()

#КонецОбласти // Получение_дополнительных_параметров

#КонецОбласти // СлужебныеПроцедурыИФункции