#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьМетодыРаспределенияКосвенныхРасходовОрганизаций() Экспорт
	
	ПустоеПодразделение = БухгалтерскийУчетПереопределяемый.ПустоеПодразделение();
	//Удаляем записи с заполненным измерением Подразделение
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", ПустоеПодразделение);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Период,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Организация,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.СчетЗатрат,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.СтатьяЗатрат,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Подразделение,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.БазаРаспределения,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.СписокСтатейЗатрат,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.СчетПрямыхЗатрат,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.ПодразделениеЗатрат
		|ИЗ
		|	РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций КАК МетодыРаспределенияКосвенныхРасходовОрганизаций
		|ГДЕ
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Подразделение <> &Подразделение";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Запись.Удалить();
		
	КонецЦикла;
	
	//Очищаем в записях заполненные ресурсы ПодразделениеЗатрат
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", ПустоеПодразделение);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Период,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Организация,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.СчетЗатрат,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.СтатьяЗатрат,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.Подразделение,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.БазаРаспределения,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.СписокСтатейЗатрат,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.СчетПрямыхЗатрат,
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.ПодразделениеЗатрат
		|ИЗ
		|	РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций КАК МетодыРаспределенияКосвенныхРасходовОрганизаций
		|ГДЕ
		|	МетодыРаспределенияКосвенныхРасходовОрганизаций.ПодразделениеЗатрат <> &Подразделение";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Прочитать();
		Запись.ПодразделениеЗатрат = ПустоеПодразделение;
		Запись.Записать();
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецЕсли
