
#Область СлужебныеПроцедурыИфункции

&НаСервере
// Процедура устанавливает параметры динамических списков.
Процедура УстановитьПараметрыДинамическихСписков()
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если Не ТекущаяСтрока = Неопределено И Не ТекущаяСтрока.Ссылка.ЭтоГруппа Тогда
		ПараметрУслуга = ТекущаяСтрока.Ссылка;
	Иначе
		ПараметрУслуга = Неопределено;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Тарифы, "Период",
																		УПЖКХ_ТиповыеМетодыКлиентСервер.ПолучитьРабочуюДату());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Тарифы, "Услуга", ПараметрУслуга);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события "ПриСозданииНаСервере" формы.
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	
	// Обработчик добавления связанных объектов.
	УПЖКХ_ОбщегоНазначенияКлиентСервер.ЗаполнитьСвязанныеОбъектыНаУправляемойФорме(ЭтаФорма, "ПодменюПерейти");
	
	#КонецЕсли
	
	УстановитьПараметрыДинамическихСписков();
	
	// ОбщиеМеханизмыИКоманды
	ОТР_ПодключаемыеОбщиеМеханизмыИКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ОбщиеМеханизмыИКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Обработчик события "ПриАктивизацииСтроки" динамического списка "Список".
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	УстановитьПараметрыДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
// Обработчик события "Выбор" динамического списка "Тарифы".
Процедура ТарифыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Регистратор);
	
КонецПроцедуры // ТарифыВыбор()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик команды "УстановкаТарифов".
Процедура УстановкаТарифов(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если Не ТекущаяСтрока = Неопределено Тогда
		СписокДокументов = УПЖКХ_ОбщегоНазначенияСервер.ПолучитьДокументыУстановкиТарифовПоУслуге(ТекущаяСтрока);
		
		Если Не СписокДокументов = Неопределено Тогда
			
			Если СписокДокументов.Количество() > 0 Тогда
				// Откроем форму списка установки тарифов по текущей услуге.
				ФормаСписка = ПолучитьФорму("Документ.КВП_УстановкаТарифов.ФормаСписка");
				
				#Если ТолстыйКлиентОбычноеПриложение Тогда
					ОтборУслуга = ФормаСписка.ДокументСписок.Отбор.Услуга;
					ОтборУслуга.ВидСравнения  = ВидСравнения.Равно;
					ОтборУслуга.Значение      = ТекущаяСтрока;
					ОтборУслуга.Использование = Истина;
				#КонецЕсли
				
				#Если ТонкийКлиент Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ФормаСписка.Список.КомпоновщикНастроек.Настройки.Отбор, "Услуга", ТекущаяСтрока,
																			ВидСравненияКомпоновкиДанных.Равно, , Истина,
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
				#КонецЕсли
				
				ФормаСписка.Открыть();
			Иначе
				// Если документов нет, создадим новый.
				ФормаОбъекта = ПолучитьФорму("Документ.КВП_УстановкаТарифов.ФормаОбъекта", Новый Структура("Услуга", ТекущаяСтрока));
				ФормаОбъекта.Открыть();
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// СхемыУчета
&НаКлиенте
// Подключаемый обработчик команды перехода к схеме учета.
Процедура Подключаемый_ОткрытьСхемуУчета(Команда)
	
	ОТР_СхемыУчетаКлиент.Подключаемый_ОткрытьСхемуУчета(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры
// Конец СхемыУчета

// ЧастоЗадаваемыеВопросы
&НаКлиенте
// Подключаемый обработчик команды перехода к часто задаваемым вопросам.
Процедура Подключаемый_ЧастоЗадаваемыеВопросыОткрытьСсылку(Команда)
	
	ОТР_ЧастоЗадаваемыеВопросыКлиент.Подключаемый_ЧастоЗадаваемыеВопросыОткрытьСсылку(Команда);
	
КонецПроцедуры
// Конец ЧастоЗадаваемыеВопросы

#КонецОбласти