#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
    КонецЕсли;
	
	Если Значение Тогда
		Справочники.ВидыНоменклатуры.СоздатьЭлементыОС();
	КонецЕсли;
	
	ВедетсяУчетОсновныхСредствПростойИнтерфейс = Значение 
		И Константы.ИнтерфейсТаксиПростой.Получить();
	Константы.ВедетсяУчетОсновныхСредствПростойИнтерфейс.Установить(ВедетсяУчетОсновныхСредствПростойИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
