
#Область СлужебныеПроцедурыИФункции

Процедура КвартальнаяОтчетностьПФРВыполнитьНазначеннуюКоманду(Форма, Команда) Экспорт
	ПерсонифицированныйУчетКлиентБазовый.КвартальнаяОтчетностьПФРВыполнитьНазначеннуюКоманду(Форма, Команда);		
КонецПроцедуры	

Процедура ПодобратьФизическихЛиц(ЭлементФормы, Организация, АдресСпискаПодобранныхСотрудников, МножественныйВыбор) Экспорт 
	
	ПерсонифицированныйУчетКлиентБазовый.ПодобратьФизическихЛиц(ЭлементФормы, Организация, АдресСпискаПодобранныхСотрудников, МножественныйВыбор);
	
КонецПроцедуры

#КонецОбласти
