#Область СлужебныеПроцедурыИФункцииНаСервере

&НаСервере
// Пересчитывает значение тарифа в строках табличной части "ТарифыЗданий".
//
Процедура ПериодПриИзмененииСервер()
	
	Для Каждого ТекущаяСтрока ИЗ Объект.ТарифыЗданий Цикл
		
		ТекущаяСтрока.Тариф = 
			ТекущаяСтрока.СуммаРасходов / (Объект.Период * ?(ТекущаяСтрока.Площадь = 0, 1, ТекущаяСтрока.Площадь));
		
	КонецЦикла;
	
КонецПроцедуры // ПериодПриИзмененииСервер()

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииНаКлиенте

&НаКлиенте
// Пересчитывает значение тарифа в строке табличной части "ТарифыЗданий".
//
Процедура ПересчитатьТарифВСтрокеТЧ()
	
	ТекущаяСтрока = Элементы.ТарифыЗданий.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Тариф = 
		ТекущаяСтрока.СуммаРасходов / (Объект.Период * ?(ТекущаяСтрока.Площадь = 0, 1, ТекущаяСтрока.Площадь));
	
КонецПроцедуры // ПересчитатьТариф()

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриЧтенииНаСервере" формы.
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УПЖКХ_ТиповыеМетодыСервер.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	УПЖКХ_ТиповыеМетодыСервер.УстановитьСостояниеДокумента(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	УПЖКХ_ТиповыеМетодыСервер.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Устанавливаем значение по умолчанию.
	Если Объект.Ссылка.Пустая() Тогда
		УПЖКХ_ЗаполнениеДокументовСервер.ЗаполнитьШапкуДокумента(Объект,
																	УПЖКХ_ТиповыеМетодыКлиентСервер.ТекущийПользователь());
		Объект.Период = 1;
		
		УПЖКХ_ТиповыеМетодыСервер.УстановитьСостояниеДокумента(ЭтотОбъект);
	КонецЕсли;
	
	// Установить доступность формы с учетом ключа СЛК.
	СЗК_МодульЗащитыКлиентСервер.УстановитьДоступностьФормыДляРедактирования(ЭтаФорма);
	
	// ОбщиеМеханизмыИКоманды
	ОТР_ПодключаемыеОбщиеМеханизмыИКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ОбщиеМеханизмыИКоманды
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
// Процедура - обработчик события "ПослеЗаписиНаСервере" формы.
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УПЖКХ_ТиповыеМетодыСервер.УстановитьСостояниеДокумента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Обработчик события "ПриИзменении" поля "Дата".
Процедура ДатаПриИзменении(Элемент)
	
	УПЖКХ_РаботаСДиалогамиКлиентСервер.ПроверитьНомерДокумента(Объект, Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
// Процедура-обработчик события "ПриИзменении" поля "Период".
//
Процедура ПериодПриИзменении(Элемент)
	
	ПериодПриИзмененииСервер();
	
КонецПроцедуры // ПериодПриИзменении()

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовТабличнойЧасти

&НаКлиенте
// Процедура-обработчик события "ПриИзменении" поля "Площадь" табличной части "ТарифыЗданий".
//
Процедура ТарифыЗданийПлощадьПриИзменении(Элемент)
	
	ПересчитатьТарифВСтрокеТЧ();
	
КонецПроцедуры // ТарифыЗданийПлощадьПриИзменении()

&НаКлиенте
// Процедура-обработчик события "ПриИзменении" поля "СуммаРасходов" табличной части "ТарифыЗданий".
//
Процедура ТарифыЗданийСуммаРасходовПриИзменении(Элемент)
	
	ПересчитатьТарифВСтрокеТЧ();
	
КонецПроцедуры // ТарифыЗданийСуммаРасходовПриИзменении()

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	УПЖКХ_ТиповыеМетодыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	
	УПЖКХ_ТиповыеМетодыСервер.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	УПЖКХ_ТиповыеМетодыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ЧастоЗадаваемыеВопросы
&НаКлиенте
// Подключаемый обработчик команды перехода к часто задаваемым вопросам.
Процедура Подключаемый_ЧастоЗадаваемыеВопросыОткрытьСсылку(Команда)
	
	ОТР_ЧастоЗадаваемыеВопросыКлиент.Подключаемый_ЧастоЗадаваемыеВопросыОткрытьСсылку(Команда);
	
КонецПроцедуры
// Конец ЧастоЗадаваемыеВопросы

#КонецОбласти