
//////////////////////////////////////////////////////////////////////////
// РАБОТА С ВРЕМЕННЫМ ХРАНИЛИЩЕМ

#Область РаботаСВременнымХранилищем

&НаСервере
// Помещает таблицу услуг во временное хранилище.
Функция ПоместитьУслугиВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.КрасноярскийКрай_ТаблицаУслуг.Выгрузить(), Новый УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

//////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события "ПриСозданииНаСервере" формы.
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получаем настройки из хранилища.
	Если Параметры.Свойство("АдресУслугВХранилище") И Не Параметры.АдресУслугВХранилище = Неопределено Тогда
		врТаблицаУслуг = ПолучитьИзВременногоХранилища(Параметры.АдресУслугВХранилище);
		Если ТипЗнч(врТаблицаУслуг) = Тип("ТаблицаЗначений") Тогда
			Объект.КрасноярскийКрай_ТаблицаУслуг.Загрузить(врТаблицаУслуг);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик команды "КомандаСохранить".
Процедура КомандаСохранить(Команда)
	
	Закрыть(ПоместитьУслугиВХранилище());
	
КонецПроцедуры

#КонецОбласти