#Область ОбработчикиСобытияСправочника

// Служит для проверки пустых строк ТЧ "ВыбранныеЛицевыеСчета" и "ВыбранныеУслуги".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Производится проверка в том случае, когда выгружаются данные не по всем лицевым счетам,
	// т.е не выбрана настройка ВыборЛицевыхСчетов: "Всем лицевым счетам".
	Если ВыборЛицевыхСчетов <> 0 Тогда
		
		ПроверяемыеРеквизиты.Добавить("ВыбранныеЛицевыеСчета");
		
		Если ВыбранныеЛицевыеСчета.Количество() > 0 Тогда
			
			Отбор = Новый Структура("ЛицевойСчет", Справочники.КВП_ЛицевыеСчета.ПустаяСсылка());
			
			Если НЕ ВыбранныеЛицевыеСчета.НайтиСтроки(Отбор).Количество() = 0 Тогда
				УПЖКХ_ТиповыеМетодыКлиентСервер.СообщитьПользователю("В списке выбранных лицевых счетов имеются пустые строки!",,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Производится проверка в том случае, когда выгружаются данные не по всем услугам,
	// т.е не выбрана настройка ВыборУслуг: "Всем услугам".
	Если ВыборУслуг <> 0 Тогда
		
		ПроверяемыеРеквизиты.Добавить("ВыбранныеУслуги");
		
		Если ВыбранныеУслуги.Количество() > 0 Тогда
			
			Отбор = Новый Структура("Услуга", Справочники.КВП_Услуги.ПустаяСсылка());
			
			Если НЕ ВыбранныеУслуги.НайтиСтроки(Отбор).Количество() = 0 Тогда
				УПЖКХ_ТиповыеМетодыКлиентСервер.СообщитьПользователю("В списке выбранных услуг имеются пустые строки!",,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
