#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Справочники.Организации.ДополнитьДанныеЗаполненияПриОднофирменномУчете(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	ЭтоФизическоеЛицо = Ложь;
	Если ЭтотОбъект.Отбор.Найти("Организация") <> Неопределено И ЗначениеЗаполнено(ЭтотОбъект.Отбор.Организация.Значение) Тогда
		ЭтоФизическоеЛицо = 
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Отбор.Организация.Значение, "ЮридическоеФизическоеЛицо")
				= Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	КонецЕсли;
	
	Если НЕ УчетЗарплаты.РасчетЗарплатыДляНебольшихОрганизаций() ИЛИ ЭтоФизическоеЛицо Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПродолжительностьОтпуска");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись ИЗ ЭтотОбъект Цикл
		
		РегистрыСведений.НастройкиУчетаЗарплаты.ЗначенияНастройкиПоУмолчанию(Запись);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
