
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события "ПриСозданииНаСервере" формы. Данное событие возникает при открытии формы, до показа окна пользователю.
//
//  Отказ                - <Булево>
//                       - Признак отказа от открытия формы.
//  СтандартнаяОбработка - <Булево>
//                       - Если данный параметр имеет значение Истина, 
//                         то выполняется копировании строки.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// В случае если открывается форма новой записи.
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		Запись.Дата            = УПЖКХ_ТиповыеМетодыКлиентСервер.ПолучитьРабочуюДату();
		Запись.Ответственный   = УПЖКХ_ТиповыеМетодыКлиентСервер.ТекущийПользователь();
		Запись.Подразделение   = УПЖКХ_ТиповыеМетодыВызовСервера.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");
		Запись.ТекстПримечания = "";
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти