
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Заголовок,ФизическоеЛицоСсылка");
	
	ПрочитатьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СотрудникиКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
	Если  ИмяСобытия = "ИзменениеДанныхМестаРаботы" И Параметр.ФизическоеЛицо = ФизическоеЛицоСсылка Тогда
		ОбработкаИзмененияДанныхОРабочемМестеНаСервере(Параметр.Сотрудник);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перечитать(Команда)
	
	ПрочитатьДанные();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НовоеМестоРаботы(Команда)
	СотрудникиКлиент.ОткрытьМестоРаботы(ЭтаФорма);
КонецПроцедуры

&НаКлиенте 
Процедура Подключаемый_ОткрытьФормуСотрудника(Команда)
	СотрудникиКлиент.ОткрытьФормуСотрудника(ЭтаФорма, Команда);	
КонецПроцедуры	

&НаКлиенте
Процедура Подключаемый_ДругиеМестаРаботы(Команда)

	СотрудникиКлиент.ОткрытьФормуСпискаМестРаботыФизическогоЛица(ФизическоеЛицоСсылка, ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьДанные()
	
	СотрудникиФормы.ЗаполнитьФормуМестамиРаботы(ЭтаФорма, "Работа", "НовоеМестоРаботы", , Истина);
		
	СотрудникиФормы.УстановитьПараметрыИнфоНадписиФормыФизЛица(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаИзмененияДанныхОРабочемМестеНаСервере(ПараметрСотрудник)
	СотрудникиФормы.ОбработкаИзмененияДанныхОРабочемМесте(ЭтаФорма, ПараметрСотрудник, "Работа","НовоеМестоРаботы", Истина);
КонецПроцедуры

#КонецОбласти
