#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик команды "Перейти_УПЖКХ_СведенияОВидахРаботВыполняемыхСОборудованием".
Процедура Перейти_УПЖКХ_СведенияОВидахРаботВыполняемыхСОборудованием(Команда)
	
	Отбор = Новый Структура("Оборудование", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.УПЖКХ_СведенияОВидахРаботВыполняемыхСОборудованием.ФормаСписка", Новый Структура("Отбор", Отбор))
	
КонецПроцедуры

&НаКлиенте
// Обработчик команды "Перейти_УПЖКХ_СведенияОМатериалахИспользуемыхПриПроведенииРаботСОборудованием".
Процедура Перейти_УПЖКХ_СведенияОМатериалахИспользуемыхПриПроведенииРаботСОборудованием(Команда)
	
	Отбор = Новый Структура("Оборудование", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.УПЖКХ_СведенияОМатериалахИспользуемыхПриПроведенииРаботСОборудованием.ФормаСписка", Новый Структура("Отбор", Отбор))
	
КонецПроцедуры

#КонецОбласти