#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает массив значений перечисления, соответствующих авансовому счету-фактуре.
// Возвращаемое значение
//    ВидыСчетовФактурНаАванс - Массив.
Функция СчетаФактурыНаАванс() Экспорт
	
	ВидыСчетовФактурНаАванс = Новый Массив();
	ВидыСчетовФактурНаАванс.Добавить(Перечисления.ВидСчетаФактурыПолученного.НаАванс);
	ВидыСчетовФактурНаАванс.Добавить(Перечисления.ВидСчетаФактурыПолученного.НаАвансКомитента);
	ВидыСчетовФактурНаАванс.Добавить(Перечисления.ВидСчетаФактурыПолученного.КорректировочныйНаАванс);
	
	Возврат ВидыСчетовФактурНаАванс;
	
КонецФункции

#КонецОбласти

#КонецЕсли