#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Проведение

// Функция возвращает параметры проведения.
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.Ответственный,
	|	Реквизиты.Организация,
	|	Реквизиты.ВидОперации,
	|	Реквизиты.Комментарий,
	|	Реквизиты.РучнаяКорректировка,
	|	Реквизиты.СпособРаспределения,
	|	Реквизиты.СуммаДокумента,
	|	Реквизиты.ТипПлощади,
	|	Реквизиты.Услуга
	|ИЗ
	|	Документ.КВП_РаспределениеУслугСтороннихОрганизаций КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("Ссылка,Номер,Дата,Ответственный,Организация,ВидОперации,
								|Комментарий,РучнаяКорректировка,СпособРаспределения,СуммаДокумента,
								|ТипПлощади,Услуга");
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРаспределения.Ссылка,
	|	ТаблицаРаспределения.НомерСтроки,
	|	ТаблицаРаспределения.Объект,
	|	ТаблицаРаспределения.Номенклатура,
	|	ТаблицаРаспределения.Сумма,
	|	ТаблицаРаспределения.ЕдиницаИзмерения,
	|	ТаблицаРаспределения.Количество
	|ИЗ
	|	Документ.КВП_РаспределениеУслугСтороннихОрганизаций.ТаблицаРаспределения КАК ТаблицаРаспределения
	|ГДЕ
	|	ТаблицаРаспределения.Ссылка = &Ссылка";
	
	ТаблицаПоТаблицеРаспределения = Запрос.Выполнить().Выгрузить();
	
	ПараметрыПроведения.Вставить("ТаблицаПоТаблицеРаспределения", ТаблицаПоТаблицеРаспределения);
	
	Возврат ПараметрыПроведения;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли