
#Область ПрограммныйИнтерфейс

// Проверяет, что переданное значение имеет ссылочный тип данных.
//
// Параметры:
//  Значение - Произвольный - проверяемое значение.
//
// Возвращаемое значение:
//  Булево - Истина, если тип значения ссылочный.
//
Функция ЗначениеСсылочногоТипа(Значение) Экспорт
	
	// В конечных конфигурациях используется вызов типового метода.
	// Н-р, в БП 3.0:
	//Возврат ОбщегоНазначения.ЗначениеСсылочногоТипа(Значение);
	Возврат ОбщегоНазначения.ЗначениеСсылочногоТипа(Значение);
	
КонецФункции

// Проверяет, является ли объект группой элементов.
//
// Параметры:
//  Объект - ЛюбаяСсылка, Объект - проверяемый объект.
//
// Возвращаемое значение:
//  Булево - Истина, если является.
//
Функция ОбъектЯвляетсяГруппой(Объект) Экспорт
	
	// В конечных конфигурациях используется вызов типового метода.
	// Н-р, в БП 3.0:
	//Возврат ОбщегоНазначения.ОбъектЯвляетсяГруппой(Объект);
	Возврат ОбщегоНазначения.ОбъектЯвляетсяГруппой(Объект);
	
КонецФункции

#КонецОбласти