#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ОграничениеДоступаНаУровнеЗаписейВключено; // Флажок изменения значения константы с Ложь на Истина.
//                                                  Используется в обработчике события ПриЗаписи.

Перем ОграничениеДоступаНаУровнеЗаписейИзменено; // Флажок изменения значения константы.
//                                                  Используется в обработчике события ПриЗаписи.

#Область ОбработчикиСобытий

// Обработчик события "ПередЗаписью" константы.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОграничениеДоступаНаУровнеЗаписейВключено
		= Значение И НЕ Константы.УПЖКХ_ИспользоватьОграничениеДоступаПоОбъектамУчета.Получить();
	
	ОграничениеДоступаНаУровнеЗаписейИзменено
		= Значение <>   Константы.УПЖКХ_ИспользоватьОграничениеДоступаПоОбъектамУчета.Получить();
	
КонецПроцедуры

// Обработчик события "ПриЗаписи" константы.
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОграничениеДоступаНаУровнеЗаписейИзменено Тогда
		УПЖКХ_УправлениеДоступомСервер.ПриИзмененииОграниченияДоступаНаУровнеЗаписейПоОбъектамУчета(ОграничениеДоступаНаУровнеЗаписейВключено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли