#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииПроведенияДокумента

// По результату запроса по шапке документа формируем движения по регистрам.
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаДолжников, Отказ, Заголовок)

	Если ТаблицаДолжников.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвижениеПоРегиструИсторияРаботыСДолжниками(СтруктураШапкиДокумента, ТаблицаДолжников, Отказ, Заголовок);
	
КонецПроцедуры

// Формирует движения по регистру "История работы с должниками".
Процедура ДвижениеПоРегиструИсторияРаботыСДолжниками(СтруктураШапкиДокумента, ТаблицаДолжников, Отказ, Заголовок)

	НаборДвижений = Движения.УПЖКХ_ИсторияРаботыСДолжниками;
	
	Для Каждого ТекДолжник Из ТаблицаДолжников Цикл

		Если ТекДолжник.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;

		Движение = НаборДвижений.Добавить();
		Движение.Период          = СтруктураШапкиДокумента.Дата;
		Движение.Организация     = СтруктураШапкиДокумента.Организация;
		Движение.Должник         = ТекДолжник.Должник;
		Движение.СуммаДолга      = ТекДолжник.Сумма;

	КонецЦикла;


КонецПроцедуры // ДвижениеПоРегиструИсторияРаботыСДолжниками()

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Обработчик события "ОбработкаЗаполнения" документа.
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УПЖКХ_ТиповыеМетодыСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура проведения документа.
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = УПЖКХ_ТиповыеМетодыВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем запрос на дополнительные параметры, нужные при проведении,
	// по данным шапки документа.
	ПараметрыПроведения = Документы.УПЖКХ_Предупреждение.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураШапкиДокумента   = ПараметрыПроведения.Реквизиты;
	ТаблицаДолжников = ПараметрыПроведения.ТаблицаДолжников;
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаДолжников, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли