#Область СлужебныеФункцииИПроцедуры

Функция СвойстваСтрокРасшифровкиПлатежаСервер(Знач ПараметрыПлатежа, Знач ПолучатьДоговор) Экспорт
	
	Возврат ПриходныйКассовыйОрдерФормы.СвойстваСтрокРасшифровкиПлатежаСервер(ПараметрыПлатежа, ПолучатьДоговор);
	
КонецФункции

Функция НовыеПараметрыПриВыбореПринятоОт(Знач ПараметрыОбъекта) Экспорт
	
	Возврат ПриходныйКассовыйОрдерФормы.НовыеПараметрыПриВыбореПринятоОт(ПараметрыОбъекта);
	
КонецФункции

Функция НаименованиеКонтрагента(Знач Контрагент) Экспорт
	
	Возврат ПриходныйКассовыйОрдерФормы.НаименованиеКонтрагента(Контрагент);
	
КонецФункции

Функция ВидимостьБанковскогоСчета(Знач Организация) Экспорт
	
	Возврат ПриходныйКассовыйОрдерФормы.ВидимостьБанковскогоСчета(Организация);
	
КонецФункции

Процедура ЗаполнитьОтражениеСтрокиВУСННаСервере(СтрокаТЧ, Знач ПараметрыУСН) Экспорт
	
	ПриходныйКассовыйОрдерФормы.ЗаполнитьОтражениеСтрокиВУСННаСервере(СтрокаТЧ, ПараметрыУСН);
	
КонецПроцедуры

#КонецОбласти

