
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыПечати

// Процедура печати листовки об интеграции с голосовыми сервисами.
//
Процедура ПечатьЛистовкиОбИнтеграцииСГолосовымиСервисами(ПараметрыПечати, АдресРезультата) Экспорт
	
	Макет   = УПЖКХ_ТиповыеМетодыСервер.ПолучитьМакет(ПараметрыПечати.ИмяМакета);
	Область = Макет.ПолучитьОбласть(ПараметрыПечати.ИмяТекущейЛистовки);
	
	Область.Параметры.Заполнить(ПараметрыПечати.ПараметрыЗаполнения);
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Область, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли