
#Область СлужебныеПроцедурыИФункции

// Возвращает структуру, описывающую параметры размещения панели вычетов
// на управляемой форме.
//
// Возвращаемое значение:
//		Структура:
//			* ИмяГруппыФормыПанелиВычеты - Строка, имя группы формы, в которой размещается панель вычетов.
//			* ПутьКДаннымПоляНалоговыйПериод - Строка, содержит путь к данным поля объекта НалоговыйПериод
//			* ТабличнаяЧастьНДФЛ - Структура, описывающая табличную часть НДФЛ
//								см. функцию УчетНДФЛКлиентСерверВнутренний. ОписаниеТабличнойЧастиНДФЛ.
//			* НастраиваемыеПанели - Соответствие, ключи соответствия соответствуют частям панели вычетов,
//								значения, именам табличных частей объекта, содержащим источники данных
//								для этого раздела (исключение раздел "ВычетыЛичные", для которого источником данных
//								является табличная часть НДФЛ, для этого раздела необходимо указать значение Истина).
//								Вариант описания настраиваемых панелей:
//									НастраиваемыеПанели.Вставить("ВычетыЛичные", Истина);
//									НастраиваемыеПанели.Вставить("ВычетыНаДетейИИмущественные", "Объект.ПримененныеВычетыНаДетейИИмущественные");
//									НастраиваемыеПанели.Вставить("ВычетыКДоходам", "Объект.Начисления");
//
Функция ОписаниеПанелиВычеты() Экспорт
	
	Возврат УчетНДФЛКлиентСерверБазовый.ОписаниеПанелиВычеты();
	
КонецФункции

// Возвращает структуру, описывающую табличную часть НДФЛ, для размещения на форме
// панели вычетов.
//
// Возвращаемое значение:
//		Структура:
//			* ИмяТаблицыФормы - Строка.
//			* ПутьКДаннымНДФЛ - Строка.
//			* ИмяПоляПериод - Строка
//			* ИмяПоляФизическоеЛицо - Строка.
//
Функция ОписаниеТабличнойЧастиНДФЛ() Экспорт
	
	Возврат УчетНДФЛКлиентСерверБазовый.ОписаниеТабличнойЧастиНДФЛ();
	
КонецФункции

Функция НДФЛТекущиеДанные(Форма, ОписаниеПанелиВычеты) Экспорт

	Возврат УчетНДФЛКлиентСерверБазовый.НДФЛТекущиеДанные(Форма, ОписаниеПанелиВычеты);
	
КонецФункции

Функция ФормаПодробнееОРасчетеНДФЛОписаниеТаблицыНДФЛ() Экспорт
	
	Возврат УчетНДФЛКлиентСерверБазовый.ФормаПодробнееОРасчетеНДФЛОписаниеТаблицыНДФЛ();
	
КонецФункции

#КонецОбласти
