
////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Формирует таблицу соответствия показателей раскрытия, представленных в макете.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица соответствия.
//
Функция ПолучитьТаблицуПоказателейРаскрытияИзМакета() Экспорт
	
	ТаблицаПоказателейРаскрытия = Новый ТаблицаЗначений;
	ТаблицаПоказателейРаскрытия.Колонки.Добавить("НазваниеПоказателя",      Новый ОписаниеТипов("Строка"));
	ТаблицаПоказателейРаскрытия.Колонки.Добавить("ПредставлениеПоказателя", Новый ОписаниеТипов("Строка"));
	ТаблицаПоказателейРаскрытия.Колонки.Добавить("ТипПоказателя",           Новый ОписаниеТипов("ОписаниеТипов"));
	ТаблицаПоказателейРаскрытия.Колонки.Добавить("ВыполняемыйКод",          Новый ОписаниеТипов("Строка"));
	ТаблицаПоказателейРаскрытия.Колонки.Добавить("ОтборПоВладельцу",        Новый ОписаниеТипов("Строка"));
	ТаблицаПоказателейРаскрытия.Колонки.Добавить("ОбъектИсточник",          Новый ОписаниеТипов("Строка"));
	
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.УПЖКХ_ВидыОперацийПодготовкиДанныхДляРаскрытия.СведенияОЗдании") Тогда
		ИмяМакета = "ПоказателиРаскрытияДанныхОЗдании";
	Иначе
		ИмяМакета = "ПоказателиРаскрытияДанныхОбУО";
	КонецЕсли;
	
	Макет = ПолучитьМакет(ИмяМакета);
	
	НомерСтроки = 2;
	Пока НЕ ПустаяСтрока(Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст) Цикл
		НоваяСтрока = ТаблицаПоказателейРаскрытия.Добавить();
		
		НоваяСтрока.НазваниеПоказателя      = Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
		НоваяСтрока.ПредставлениеПоказателя = Макет.Область(НомерСтроки, 2, НомерСтроки, 2).Текст;
		НоваяСтрока.ВыполняемыйКод          = Макет.Область(НомерСтроки, 4, НомерСтроки, 4).Текст;
		НоваяСтрока.ОтборПоВладельцу        = Макет.Область(НомерСтроки, 5, НомерСтроки, 5).Текст;
		
		ЗначениеТипаПоказателя = Макет.Область(НомерСтроки, 3, НомерСтроки, 3).Текст;
		Квалификатор           = Макет.Область(НомерСтроки, 6, НомерСтроки, 6).Текст;
		Если НоваяСтрока.ОтборПоВладельцу = "Истина" Тогда
			НоваяСтрока.ОбъектИсточник = СтрЗаменить(ЗначениеТипаПоказателя, "Ссылка", "");
		КонецЕсли;
		
		Если ЗначениеТипаПоказателя = "Строка" Тогда
			
			НоваяСтрока.ТипПоказателя = УПЖКХ_ТиповыеМетодыКлиентСервер.ПолучитьОписаниеТиповСтроки(Число(Квалификатор));
			
		ИначеЕсли ЗначениеТипаПоказателя = "Число" Тогда
			ПозицияЗапятой = Найти(Квалификатор, ",");
			РазрядностьЧисла = Сред(Квалификатор, 1, ПозицияЗапятой - 1);
			РазрядностьДроби = Сред(Квалификатор, ПозицияЗапятой + 1, СтрДлина(Квалификатор) - ПозицияЗапятой);
			
			НоваяСтрока.ТипПоказателя = УПЖКХ_ТиповыеМетодыКлиентСервер.ПолучитьОписаниеТиповЧисла(РазрядностьЧисла, РазрядностьДроби);
			
		ИначеЕсли ЗначениеТипаПоказателя = "Дата" Тогда
			
			НоваяСтрока.ТипПоказателя = УПЖКХ_ТиповыеМетодыКлиентСервер.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
			
		Иначе
			
			НоваяСтрока.ТипПоказателя = Новый ОписаниеТипов(ЗначениеТипаПоказателя,);
			
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат ТаблицаПоказателейРаскрытия;
	
КонецФункции // ПолучитьТаблицуПоказателейРаскрытияИзМакета()

#КонецОбласти

#КонецЕсли
