#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		Запись.Период = НачалоГода(ОбщегоНазначения.ТекущаяДатаПользователя());
		Если Запись.Организация.Пустая() Тогда
			Запись.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		КонецЕсли;
		Если НЕ Запись.Организация.Пустая() Тогда
			Запись.РегистрацияВНалоговомОргане = 
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Организация, "РегистрацияВНалоговомОргане");
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПараметрыНастройкиНалога();
	
	МестныеНалоги = РегистрыСведений.ПорядокУплатыНалоговНаМестах.НалогиПорядокКоторыхУстанавливаетсяНаМестах();
	
	СписокВыбораВидаНалога = Элементы.Налог.СписокВыбора;
	Для Каждого Налог Из МестныеНалоги Цикл
		СписокВыбораВидаНалога.Добавить(Налог);
	КонецЦикла;
	
	// Настроим список выбора - представления всех месяцев
	СписокВыбора = Элементы.СрокУплатыНалогаМесяцев.СписокВыбора;
	Для НомерМесяца = 0 По 11 Цикл
		УсловнаяДата = ДобавитьМесяц('20130101', НомерМесяца);
		ПредставлениеМесяца = СтрЗаменить(
			Формат(УсловнаяДата, "ДФ=dd@MMMM"),
			Формат(УсловнаяДата, "ДФ=dd@"),
			"");
		СписокВыбора.Добавить(НомерМесяца, ПредставлениеМесяца);
	КонецЦикла;
	
	Если Параметры.Ключ.Пустой() Тогда
		УстановитьСрокУплатыНалогаАвансов(ЭтаФорма);
	КонецЕсли;
	
	УстановитьГоловнуюОрганизацию(ЭтаФорма);
	НастроитьСрокУплатыНалогаМесяцев(ЭтаФорма);
	НастроитьСрокУплатыАвансов(ЭтаФорма);
	ОбновитьОписаниеСрокаУплаты(ЭтаФорма);
	
	ВыборНалогаДоступен = Истина;
		
	Если Параметры.ЗначенияЗаполнения.Свойство("Налог")
	   И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Налог) Тогда
		ВыборНалогаДоступен = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ВыборНалогаДоступен") Тогда
		ВыборНалогаДоступен = Параметры.ВыборНалогаДоступен;
	КонецЕсли;
	
	ЭтаФорма.Элементы.Налог.Видимость = ВыборНалогаДоступен;
	Если НЕ ВыборНалогаДоступен Тогда
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		Код = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Налог, "Код");
		Если Код = "НалогНаИмущество" Тогда
			ЭтаФорма.Заголовок = НСтр("ru='Налог на имущество: порядок уплаты'");
		ИначеЕсли Код = "ТранспортныйНалог" Тогда
			ЭтаФорма.Заголовок = НСтр("ru='Транспортный налог: порядок уплаты'");
		ИначеЕсли Код = "ЗемельныйНалог" Тогда
			ЭтаФорма.Заголовок = НСтр("ru='Земельный налог: порядок уплаты'");
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущийПериод = Запись.Период;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если НЕ Отказ И НЕ ТекущийОбъект.Выбран() Тогда

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период",						Запись.Период);
		Запрос.УстановитьПараметр("Организация",				Запись.Организация);
		Запрос.УстановитьПараметр("Налог",						Запись.Налог);
		Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане",Запись.РегистрацияВНалоговомОргане);

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПорядокУплатыНалоговНаМестах.Период
		|ИЗ
		|	РегистрСведений.ПорядокУплатыНалоговНаМестах КАК ПорядокУплатыНалоговНаМестах
		|ГДЕ
		|	ПорядокУплатыНалоговНаМестах.Период = &Период
		|	И ПорядокУплатыНалоговНаМестах.Организация = &Организация
		|	И ПорядокУплатыНалоговНаМестах.Налог = &Налог
		|	И ПорядокУплатыНалоговНаМестах.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			ТекстСообщения = НСтр("ru = 'На %1 в налоговом органе <%2> по виду налога <%3> уже есть запись в организации <%4>'");
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
				Формат(Запись.Период, "ДФ=dd.MM.yyyy"),
				СокрЛП(Запись.РегистрацияВНалоговомОргане),
				СокрЛП(Запись.Налог),
				СокрЛП(Запись.Организация));
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Запись.Организация", "", Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Запись.Налог) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Вид налога'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Запись.Налог", "", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СрокУплатыНалогаДнейПриИзменении(Элемент)
	
	ПроверитьДопустимостьДаты();
	
	НастроитьСрокУплатыНалогаМесяцев(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СрокУплатыНалогаМесяцевПриИзменении(Элемент)
	
	ПроверитьДопустимостьДаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДопустимостьДаты()
	
	Если Запись.СрокУплатыНалогаМесяцев > 0 И Запись.СрокУплатыНалогаДней <= 31 Тогда
		// Убедимся, что число не превышает количество дней в выбранном месяце.
		// Ориентируемся на високосный год.
		КоличествоДнейВМесяце = День(Дата(2000, Запись.СрокУплатыНалогаМесяцев + 2, 1) - 1);
		Если Запись.СрокУплатыНалогаДней > КоличествоДнейВМесяце Тогда
			Запись.СрокУплатыНалогаДней = КоличествоДнейВМесяце;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УплачиваютсяАвансыПриИзменении(Элемент)
	НастроитьСрокУплатыАвансов(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СрокУплатыАвансаМесяцевПриИзменении(Элемент)
	ОбновитьОписаниеСрокаУплаты(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СрокУплатыАвансаДнейПриИзменении(Элемент)
	ОбновитьОписаниеСрокаУплаты(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НалогПриИзменении(Элемент)
	
	ЗаполнитьПараметрыНастройкиНалога();
	УстановитьСрокУплатыНалогаАвансов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Организация) Тогда
		ОрганизацияПриИзмененииНаСервере();
		УстановитьСрокУплатыНалогаАвансов(ЭтаФорма);
	Иначе
		ПараметрыНастройкиНалога.Очистить();
		ГоловнаяОрганизация = Неопределено;
		Запись.РегистрацияВНалоговомОргане = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Запись.Период = ТекущийПериод Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПараметрыНастройкиНалога();
	
	УстановитьСрокУплатыНалогаАвансов(ЭтаФорма);
	
	ТекущийПериод = Запись.Период;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияВНалоговомОрганеПриИзменении(Элемент)
	
	УстановитьСрокУплатыНалогаАвансов(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	УстановитьГоловнуюОрганизацию(ЭтаФорма);
	
	Если ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		Запись.РегистрацияВНалоговомОргане = 
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГоловнаяОрганизация, "РегистрацияВНалоговомОргане");
	КонецЕсли;
	
	ЗаполнитьПараметрыНастройкиНалога();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Настройка формы

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьСрокУплатыНалогаМесяцев(Форма)
	
	Запись = Форма.Запись;
	
	ВыбиратьМесяц = (Запись.СрокУплатыНалогаДней <= 31);
	
	Если ВыбиратьМесяц И Запись.СрокУплатыНалогаМесяцев = -1 Тогда
		Запись.СрокУплатыНалогаМесяцев = 0;
	ИначеЕсли Не ВыбиратьМесяц Тогда
		Запись.СрокУплатыНалогаМесяцев = -1;
	КонецЕсли;
	
	СписокВыбора = Форма.Элементы.СрокУплатыНалогаМесяцев.СписокВыбора;
	ЭлементСписка = СписокВыбора.НайтиПоЗначению(-1);
	Если ЭлементСписка <> Неопределено Тогда
		СписокВыбора.Удалить(ЭлементСписка);
	КонецЕсли;
	
	Если Не ВыбиратьМесяц Тогда
		ТекстПолностью = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
			Запись.СрокУплатыНалогаДней,
			НСтр("ru = 'календарный день, календарных дня, календарных дней'"));
		ТолькоСлова = СокрЛП(Сред(ТекстПолностью, 1 + СтрДлина("" + Запись.СрокУплатыНалогаДней)));
		СписокВыбора.Вставить(0, -1, ТолькоСлова);
	КонецЕсли;
	
	Элемент = Форма.Элементы.СрокУплатыНалогаМесяцев;
	Элемент.ТолькоПросмотр = Не ВыбиратьМесяц;
	Элемент.КнопкаВыбора   = ВыбиратьМесяц;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьСрокУплатыАвансов(Форма)
	
	Форма.Элементы.СрокУплатыАванса.Доступность = Форма.Запись.УплачиваютсяАвансы;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОписаниеСрокаУплаты(Форма)
	
	Запись = Форма.Запись;
	
	УсловнаяДата = '20130101';
	
	Дней = 24 * 60 * 60;
	
	СрокиУплаты = Новый Массив;
	Для НомерКвартала = 1 По 3 Цикл
		Дата = ДобавитьМесяц(УсловнаяДата, 3 * НомерКвартала + Запись.СрокУплатыАвансаМесяцев) + Дней * Запись.СрокУплатыАвансаДней - 1;
		СрокиУплаты.Добавить(Формат(Дата, "ДФ='dd MMMM'"));
	КонецЦикла;
	
	ПереченьСроков = СтрСоединить(СрокиУплаты, ", ");
	Форма.ОписаниеСрокаУплатыАванса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '(%1)'"),
		ПереченьСроков);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьГоловнуюОрганизацию(Форма)
	
	Форма.ГоловнаяОрганизация = ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Форма.Запись.Организация);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНастройкиНалога()
	
	ПараметрыНастройкиНалога.Очистить();
	
	ПорядокУплатыНефедеральныхНалогов = РегистрыСведений.ПорядокУплатыНалоговНаМестах.ПорядокУплатыРегиональныхМестныхНалогов(
										Запись.Организация, Запись.Период);
	
	Для Каждого ПорядокУплатыНалога Из ПорядокУплатыНефедеральныхНалогов Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыНастройкиНалога.Добавить(), ПорядокУплатыНалога);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСрокУплатыНалогаАвансов(Форма)
	
	Запись = Форма.Запись;
	
	Если Запись.СрокУплатыНалогаДней = 0 
	   И Запись.СрокУплатыНалогаМесяцев = 0
	   И Запись.СрокУплатыАвансаДней = 0
	   И Запись.СрокУплатыАвансаМесяцев = 0 Тогда

		Отбор = Новый Структура("Налог, РегистрацияВНалоговомОргане", Запись.Налог, Запись.РегистрацияВНалоговомОргане);
		МассивСтрок = Форма.ПараметрыНастройкиНалога.НайтиСтроки(Отбор);
		Для Каждого ПараметрНастройки Из МассивСтрок Цикл
			ЗаполнитьЗначенияСвойств(Запись, ПараметрНастройки, ,"Налог");
		КонецЦикла;
		
		НастроитьСрокУплатыАвансов(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти