#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолноеИмяОперации(ВидОперации) Экспорт
	
	Если ВидОперации = ПокупкаКомиссия Тогда
		Возврат НСтр("ru = 'Возврат товаров поставщику'");
	ИначеЕсли ВидОперации = ИзПереработки Тогда
		Возврат НСтр("ru = 'Возврат материалов заказчику'");
	ИначеЕсли ВидОперации = Оборудование Тогда
		Возврат НСтр("ru = 'Возврат оборудования поставщику'");
	Иначе
		Возврат НСтр("ru = 'Возврат поставщику'");
	КонецЕсли;
		
КонецФункции	
	
#КонецЕсли