////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура КомандаОК(Команда)

	ПараметрЗакрытия = Новый Структура;
	ПараметрЗакрытия.Вставить("ОтражатьВБухгалтерскомУчете", ОтражатьВБухгалтерскомУчете);
	ПараметрЗакрытия.Вставить("ОтражатьВНалоговомУчете", ОтражатьВНалоговомУчете);
	ПараметрЗакрытия.Вставить("ОтражатьПоСпециальнымРегистрам", ОтражатьПоСпециальнымРегистрам);
	ПараметрЗакрытия.Вставить("ДатаВводаОстатков", ДатаВводаОстатков);

	Закрыть(ПараметрЗакрытия);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВстроеннаяСправка = Документы.ВводНачальныхОстатков.ПолучитьТекстВстроеннойСправки("НастройкаРежима");

	Организация                    = Параметры.Организация;
	ОтражатьВБухгалтерскомУчете    = Параметры.ОтражатьВБухгалтерскомУчете;
	ОтражатьВНалоговомУчете        = Параметры.ОтражатьВНалоговомУчете;
	ОтражатьПоСпециальнымРегистрам = Параметры.ОтражатьПоСпециальнымРегистрам;
	
	ТолькоПросмотр = Параметры.ТолькоПросмотр;

	ДатаВводаОстатков = Документы.ВводНачальныхОстатков.ПолучитьДатуВводаОстатков(Организация);

КонецПроцедуры
