#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьРасчетыПриОплате(Форма, НазваниеТабличнойЧасти) Экспорт
	
	ИзменитьРасчетыПриОплате(Форма, Ложь);
	ЗаполнитьСписокВыбораПорядкаОтраженияДоходаВТЧ(Форма, НазваниеТабличнойЧасти);
	
КонецПроцедуры

Процедура УстановитьРасчетыПриОплате(Форма, НазваниеТабличнойЧасти) Экспорт
	
	ИзменитьРасчетыПриОплате(Форма, Истина);
	ЗаполнитьСписокВыбораПорядкаОтраженияДоходаВТЧ(Форма, НазваниеТабличнойЧасти);
	
КонецПроцедуры

// Устанавливает значение реквизитов РасчетыПриОплате и БезЗакрывающихДокументов в зависимости от настроенных опций.
//
// Параметры:
//   Форма                              - УправляемаяФорма
//   УстановитьБезЗакрывающихДокументов - Булево
//
Процедура ИзменитьРасчетыПриОплате(Форма, УстановитьБезЗакрывающихДокументов) Экспорт
	
	Если ФормаРасшифровкиПлатежа(Форма) Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	УчетБезДокументовВозможен = УчетДенежныхСредствБП.УчетБезЗакрывающихДокументовВозможен(Объект.Организация, Объект.Дата);
	
	ЕстьРасчетыСПокупателями = УчетДенежныхСредствКлиентСервер.ЕстьРасчетыСПокупателями(Объект.ВидОперации);
	ИспользоватьДокументыРеализации = ПолучитьФункциональнуюОпцию("ИспользоватьДокументыРеализации");
	ЕстьРасчетыСПоставщиками = УчетДенежныхСредствКлиентСервер.ЕстьРасчетыСПоставщиками(Объект.ВидОперации);
	ИспользоватьДокументыПоступления = ПолучитьФункциональнуюОпцию("ИспользоватьДокументыПоступления");
	ЕстьРозничнаяВыручка = УчетДенежныхСредствКлиентСервер.ЕстьРозничнаяВыручка(Объект.ВидОперации);
	ИспользоватьДокументыРозничнойТорговли = УчетДенежныхСредств.ИспользоватьЗакрывающиеДокументыРозничнойТорговли();
	
	Форма.РасчетыПриОплатеВидимость = УчетБезДокументовВозможен
		И (ЕстьРасчетыСПокупателями И ИспользоватьДокументыРеализации
		Или ЕстьРасчетыСПоставщиками И ИспользоватьДокументыПоступления
		Или ЕстьРозничнаяВыручка И ИспользоватьДокументыРозничнойТорговли);
		
	Если УстановитьБезЗакрывающихДокументов Тогда
		Если УчетБезДокументовВозможен Тогда
			Если НЕ Форма.РасчетыПриОплатеВидимость Тогда
				Объект.БезЗакрывающихДокументов = ЕстьРасчетыСПокупателями И Не ИспользоватьДокументыРеализации
					Или ЕстьРасчетыСПоставщиками И Не ИспользоватьДокументыПоступления
					Или ЕстьРозничнаяВыручка И Не ИспользоватьДокументыРозничнойТорговли;
			КонецЕсли;
		Иначе
			Объект.БезЗакрывающихДокументов = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Форма.РасчетыПриОплате = ?(Объект.БезЗакрывающихДокументов, "БезДокументов", "ПоДокументам");
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораПорядкаОтраженияДоходаВТЧ(Форма, НазваниеТабличнойЧасти) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если НЕ Объект.БезЗакрывающихДокументов 
		ИЛИ (НЕ УчетДенежныхСредствКлиентСервер.ЕстьРасчетыСПокупателями(Объект.ВидОперации)
			И Не УчетДенежныхСредствКлиентСервер.ЕстьРозничнаяВыручка(Объект.ВидОперации)) Тогда
		Форма.ПолеОтражениеДоходаВидимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ЭлементПолеОтражениеДохода = Элементы.Найти(НазваниеТабличнойЧасти + "ПолеОтражениеДохода");
	Если ЭлементПолеОтражениеДохода <> Неопределено Тогда
		НалоговыйУчетУСН.ЗаполнитьСписокВыбораПорядкаОтраженияАвансовДляТЧ(
			ЭлементПолеОтражениеДохода,
			Форма.ПорядокОтраженияДоходаСоответствиеЗначений,
			Объект);
		Форма.ПолеОтражениеДоходаВидимость = Форма.ПорядокОтраженияДоходаСоответствиеЗначений.Количество() > 1;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗаголовокДоговорСтатьяРасходов(Форма) Экспорт
	
	Объект = Форма.объект;
	Элементы = Форма.Элементы;
	
	Если Объект.БезЗакрывающихДокументов Тогда
		ТекстЗаголовка = НСтр("ru = 'Статья расходов'");
	ИначеЕсли Форма.ВестиУчетПоДоговорам Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиДвиженияДенежныхСредств") Тогда
			ТекстЗаголовка = НСтр("ru = 'Договор / Статья расходов'");
		Иначе
			ТекстЗаголовка = НСтр("ru = 'Договор'");
		КонецЕсли;
	Иначе
		ТекстЗаголовка = НСтр("ru = 'Статья расходов'");
	КонецЕсли;
	
	Элементы.РасшифровкаПлатежаГруппаДоговор.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

Процедура УстановитьЗаголовокДоговорСтатьяДоходов(Форма) Экспорт
	
	Объект = Форма.объект;
	Элементы = Форма.Элементы;
	
	Если Объект.БезЗакрывающихДокументов Тогда
		ТекстЗаголовка = НСтр("ru = 'Статья доходов'");
	ИначеЕсли Форма.ВестиУчетПоДоговорам Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиДвиженияДенежныхСредств") Тогда
			ТекстЗаголовка = НСтр("ru = 'Договор / Статья доходов'");
		Иначе
			ТекстЗаголовка = НСтр("ru = 'Договор'");
		КонецЕсли;
	Иначе
		ТекстЗаголовка = НСтр("ru = 'Статья доходов'");
	КонецЕсли;
	
	Элементы.РасшифровкаПлатежаГруппаДоговор.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеБезЗакрывающихДокументов(Форма, НачалоПутиКДанным) Экспорт
	
	Элементы = Форма.Элементы;
	УсловноеОформление = Форма.УсловноеОформление;
	
	// Поля не отображаются в режиме БезЗакрывающихДокументов.
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаДоговорКонтрагента", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаСпособПогашенияЗадолженности", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаСделка", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаНадписьКурс", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаНадписьСумма", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаНадписьСуммаВал", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаКурсВзаиморасчетов", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаСуммаВзаиморасчетов", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаСчетНаОплату", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаСтавкаНДС", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаСуммаНДС", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаСчетУчетаРасчетовСКонтрагентом", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаСчетУчетаРасчетовПоАвансам", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаСчетУчетаРасчетовПоАвансамПриУСН", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаПолеОтражениеАванса", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаДоходыУСН", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаВидПлатежаПоКредитамЗаймам", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаРасходыУСН", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаНДСУСН", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаРаспределятьРасходыУСН", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаПлатежаПлатежныеКартыСчетУчетаРасчетовСКонтрагентом", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаВыручкиСтавкаНДС", ЭлементУО, Элементы);
	ДобавитьПолеВУсловноеОформление("РасшифровкаВыручкиСуммаНДС", ЭлементУО, Элементы);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ЭлементУО.Отбор,
		НачалоПутиКДанным + "БезЗакрывающихДокументов",
		ВидСравненияКомпоновкиДанных.Равно,
		Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// РасшифровкаПлатежаПолеОтражениеДохода
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасшифровкаПлатежаПолеОтражениеДохода");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ЭлементУО.Отбор,
		"ПолеОтражениеДоходаВидимость",
		ВидСравненияКомпоновкиДанных.Равно,
		Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

Процедура ДобавитьПолеВУсловноеОформление(ИмяПоля, ЭлементОформления, ВсеЭлементы)
	
	Если ВсеЭлементы.Найти(ИмяПоля) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, ИмяПоля);
	
КонецПроцедуры

Функция ФормаРасшифровкиПлатежа(Форма)
	
	Возврат СтрНайти(Форма.ИмяФормы, "ФормаРасшифровкаПлатежа") > 0;
	
КонецФункции

Процедура ЗаполнитьВариантыРасчетовПриОплате(СписокВыбора, ВидОперации) Экспорт
	
	Если УчетДенежныхСредствКлиентСервер.ЕстьРозничнаяВыручка(ВидОперации) Тогда
		ПредставлениеПоДокументам = НСтр("ru = 'По отчетам о продажах'");
	Иначе
		ПредставлениеПоДокументам = НСтр("ru = 'По актам и накладным'");
	КонецЕсли;
	ПредставлениеБезДокументов = НСтр("ru = 'Без закрывающих документов'");
	
	СписокВыбора.Очистить();
	СписокВыбора.Добавить("ПоДокументам", ПредставлениеПоДокументам);
	СписокВыбора.Добавить("БезДокументов", ПредставлениеБезДокументов);
	
КонецПроцедуры

Функция ЕстьОсновнойДоговор(ПараметрыПлатежа) Экспорт
	
	ЕстьОсновнойДоговор = РаботаСДоговорамиКонтрагентовБП.ЭтоОсновнойДоговорКонтрагента(ПараметрыПлатежа.ДоговорКонтрагента);
	
	Если Не ЕстьОсновнойДоговор Тогда
		ВидыДоговоров       = УчетДенежныхСредствКлиентСервер.ОпределитьВидДоговораСКонтрагентом(ПараметрыПлатежа.ВидОперации);
		ПараметрыДоговора   = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыПлатежа.ДоговорКонтрагента, "Организация, Владелец");
		ЕстьОсновнойДоговор = РаботаСДоговорамиКонтрагентовБП.ЕстьОсновнойДоговорКонтрагента(
			ВидыДоговоров, ПараметрыДоговора.Организация, ПараметрыДоговора.Владелец);
		
		Если Не ЕстьОсновнойДоговор Тогда
			НовыйДоговор = УчетДенежныхСредствБП.ПолучитьДоговорКонтрагента(ПараметрыПлатежа);
			ЕстьОсновнойДоговор = НовыйДоговор = ПараметрыПлатежа.ДоговорКонтрагента; // договор не основной, но единственный
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьОсновнойДоговор;
	
КонецФункции

Функция СтатьяДДСДляОперацииНастроена(СтатьяДДС, КонтекстОперации) Экспорт
	
	ЭтоПредопределенный  = ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяДДС, "ИмяПредопределенныхДанных"));
	СтатьяДДСПоУмолчанию = УчетДенежныхСредствБП.СтатьяДДСПоУмолчанию(КонтекстОперации);
	
	Возврат ЭтоПредопределенный Или ЗначениеЗаполнено(СтатьяДДСПоУмолчанию);
	
КонецФункции

Процедура УстановитьУсловноеОформлениеНПД(Форма) Экспорт
	
	// Условное оформление поля "номер чека" для чеков НПД
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "НомерЧека");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементОформления.Отбор,
		"ИспользуетсяНПД", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Условное оформление аннулированных чеков НПД
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	
	ГруппаЭлементовОтбора = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ЭлементОформления.Отбор.Элементы,
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаЭлементовОтбора, "Список.Состояние",
		ВидСравненияКомпоновкиДанных.Равно, Перечисления.СостоянияЧековНПД.Аннулирован);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаЭлементовОтбора, "Список.ПроизведенВозвратПоЧеку",
		ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементОформления.Отбор,
		"ИспользуетсяНПД", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.АннулированныеЧекиНПД);
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "Список");

КонецПроцедуры

#Область ОбработчикиБаннераНПД

Функция ВидимостьБаннераПредупреждениеОЗаполненииРеквизитовПлатежаНПД(Форма)
	
	Объект = Форма.Объект;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не УчетнаяПолитика.ПрименяетсяНалогНаПрофессиональныйДоход(Объект.Организация, Объект.Дата) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Объект.ВидОперации <> Перечисления.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеНалога
		И Объект.ВидОперации <> Перечисления.ВидыОперацийРКО.УплатаНалога Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Налог)
		Или ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Налог, "ВидНалога") <> Перечисления.ВидыНалогов.НалогНаПрофессиональныйДоход Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ДоступнаИнтеграцияСПлатформойСамозанятые") Тогда
		// Для организации на НПД, для которой нет возможности подключиться к платформе Самозанятых,
		// показываем баннер всегда.
		Возврат Истина;
	КонецЕсли;
	
	// Для организации на НПД, которая может подключится к платформе Самозанятых,
	// показываем баннер в том случае, если реквизиты не заполнены.
	Возврат Не ЗначениеЗаполнено(Объект.Контрагент) Или Не ЗначениеЗаполнено(Объект.СчетКонтрагента)
		Или Не ЗначениеЗаполнено(Объект.КодОКАТО);
	
КонецФункции

Функция ТекстБаннераПредупреждениеОЗаполненииРеквизитовПлатежаНПД()
	
	ЧастиТекста = Новый Массив;
	
	Если ПолучитьФункциональнуюОпцию("ДоступнаИнтеграцияСПлатформойСамозанятые") Тогда
		ЧастиТекста.Добавить(НСтр("ru = 'Автоматически заполнить платежный документ можно из помощника по уплате'"));
		ЧастиТекста.Добавить(" ");
		ЧастиТекста.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Налога на профессиональный доход'"),
			, , , "ОткрытьПомощникНПД"));
	Иначе
		ЧастиТекста.Добавить(НСтр("ru = 'Укажите реквизиты платежа из уведомления сервиса'"));
		ЧастиТекста.Добавить(" ");
		ЧастиТекста.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Мой налог'"),
			, , , "ПерейтиВЛичныйКабинетНПД"));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(ЧастиТекста);
	
КонецФункции

Процедура ПоказатьБаннерПредупреждениеОЗаполненииРеквизитовПлатежаНПД(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Элементы.Найти("ПредупреждениеОЗаполненииРеквизитовПлатежаНПД") = Неопределено Тогда
		// Баннера на форме нет, ничего показывать не нужно.
		Возврат;
	КонецЕсли;
	
	ВидимостьБаннера = ВидимостьБаннераПредупреждениеОЗаполненииРеквизитовПлатежаНПД(Форма);
	
	Если ВидимостьБаннера Тогда
		Элементы.ДекорацияПредупреждениеОЗаполненииРеквизитовПлатежаНПД.Заголовок = 
			ТекстБаннераПредупреждениеОЗаполненииРеквизитовПлатежаНПД();
	КонецЕсли;
	
	Элементы.ПредупреждениеОЗаполненииРеквизитовПлатежаНПД.Видимость = ВидимостьБаннера;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияСБанком

Процедура ОпределитьСчетаБезИнтеграции(Форма) Экспорт
	
	Если Не Форма.ИнтеграцияСБанкамиПодключена Тогда
		Возврат;
	КонецЕсли;
	
	// В режиме интеграции, требуется загружать выписку только по тем счетам, с которыми не настроена интеграция,
	// т.к. по счетам итеграции выписка загружается автоматически.
	СчетаБезИнтеграции = Справочники.НастройкиИнтеграцииСБанками.БанковскиеСчетаОрганизацииБезИнтеграции(
		Форма.ОтборОрганизация);
	КоличествоСчетовБезИнтеграции = СчетаБезИнтеграции.Количество();
	
	Форма.ЕстьБанковскиеСчетаБезИнтеграции = КоличествоСчетовБезИнтеграции > 0;
	
	Форма.БанковскиеСчетаБезИнтеграции = Новый Структура;
	Форма.БанковскиеСчетаБезИнтеграции.Вставить("Счета", СчетаБезИнтеграции);
	
КонецПроцедуры

Процедура СкрытьНажатиеТекстКонтекстнаяПодсказкиИнтеграцияСБанком(Форма) Экспорт
	
	Форма.ВидимостьКонтекстнаяПодсказкаИнтеграцияСБанком = Ложь;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"ВидимостьКонтекстнаяПодсказкаИнтеграцияСБанком",
		Форма.БИКБанкаИнтеграции,
		Форма.ВидимостьКонтекстнаяПодсказкаИнтеграцияСБанком);
	
	ПоказатьКонтекстнаяПодсказкаИнтеграцияСБанком(Форма);
	
КонецПроцедуры

Процедура ПоказатьКонтекстнаяПодсказкаИнтеграцияСБанком(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Элементы.ГруппаКонтекстнаяПодсказкаИнтеграцияСБанком.Видимость = Форма.ВидимостьКонтекстнаяПодсказкаИнтеграцияСБанком;
	
	Если Не Форма.ВидимостьКонтекстнаяПодсказкаИнтеграцияСБанком
		Или Не ЗначениеЗаполнено(Форма.НазваниеБанкаИнтеграции) Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиБанера = Новый Массив;
	ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(
		НСтр("ru = 'Интеграция с банком'"), Новый Шрифт(Новый Шрифт,, 14)));
	ЧастиБанера.Добавить(Символы.ПС);
	ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Операции из'")));
	ЧастиБанера.Добавить(" ");
	ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(Форма.НазваниеБанкаИнтеграции));
	ЧастиБанера.Добавить(" ");
	ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'загружаются автоматически.'")));
	ЧастиБанера.Добавить(Символы.ПС);
	ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(
		НСтр("ru = 'Чтобы создавать документы и загружать выписки по счету в другом банке, укажите его в разделе'")));
	ЧастиБанера.Добавить(" ");
	ЧастиБанера.Добавить(Новый ФорматированнаяСтрока(
		НСтр("ru = 'Настройки'"),,,, "e1cib/command/Обработка.ПанелиПростойИнтерфейс.Команда.Настройки"));
	
	Элементы.ДекорацияТекстКонтекстнаяПодсказкаИнтеграцияСБанком.Заголовок = Новый ФорматированнаяСтрока(ЧастиБанера);
	
КонецПроцедуры

Процедура НастроитьФормуДокументаДляРежимаИнтеграцииСБанком(Форма) Экспорт
	
	// Упростить можно только однострочную форму
	Если БанкИКассаФормыКлиентСервер.ФормаДокументаИнтеграцииСБанком(Форма)
		Или Не БанкИКассаФормыКлиентСервер.ФормаДокументаОднострочная(Форма) Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ИнтеграцияОрганизацииВключена =
		Справочники.НастройкиИнтеграцииСБанками.ИнтеграцияОрганизацииВключена(Форма.Объект.Организация);
	
	Если Не Форма.ИнтеграцияОрганизацииВключена Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.ГруппаПодвал.Видимость = Ложь;
	
	Элемент = ЭлементГруппаКомандКоманднойПанели(Форма, "ГруппаГлобальныеКоманды");
	ОтключитьВидимостьЭлемента(Элемент);
	
	Элемент = ЭлементГруппаКомандКоманднойПанели(Форма, "ГруппаВажныеКоманды");
	ОтключитьВидимостьЭлемента(Элемент);
	
	СкрытьКомандыЗаписиПроведенияНеЗакрывающиеФормуДокумента(Форма);
	
КонецПроцедуры

Процедура НастроитьФормуЖурналаДляРежимаИнтеграции(Форма, ИнтеграцияОрганизацииВключена) Экспорт
	
	// Упростить можно только однострочную форму
	Если Не ИнтеграцияОрганизацииВключена Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Список, "ПометкаУдаления", Ложь,,, Истина);
	
	НастроитьКонтекстноеМеню(Форма);
	
	Элемент = ЭлементГруппаКомандКоманднойПанели(Форма, "ГруппаГлобальныеКоманды", Элементы.ГруппаКнопкиКоманднойПанели);
	ОтключитьВидимостьЭлемента(Элемент);
	
	ЭлементГруппаПроведение = ЭлементГруппаКомандКоманднойПанели(
		Форма, "ФормаПроведение", Элементы.ГруппаКнопкиКоманднойПанели);
	ЭлементОтменаПроведения = ЭлементВДереве(
		ЭлементГруппаПроведение, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ФормаОтменаПроведения"));
	ОтключитьВидимостьЭлемента(ЭлементОтменаПроведения);
	
	ЭлементГруппаВажныеКоманды = ЭлементГруппаКомандКоманднойПанели(
		Форма, "ГруппаВажныеКоманды", Элементы.ГруппаКнопкиКоманднойПанели);
	Если ЭлементГруппаВажныеКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Элемент Из ЭлементГруппаВажныеКоманды.ПодчиненныеЭлементы Цикл
		Если СтрЗаканчиваетсяНа(Элемент.Имя, "КлиентБанк") Тогда
			Если Элемент.Имя = "ЗагрузитьИзКлиентБанк" Тогда
				Элемент.Заголовок = НСтр("ru = 'Загрузить из другого банка'");
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		ОтключитьВидимостьЭлемента(Элемент);
	КонецЦикла;
	
КонецПроцедуры

Процедура СкрытьКомандыЗаписиПроведенияНеЗакрывающиеФормуДокумента(Форма)
	
	Элемент = ЭлементГруппаКомандКоманднойПанели(Форма);
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыСтрокиДереваРасположенияКоманды = Новый Массив;
	ЭлементыСтрокиДереваРасположенияКоманды.Добавить("ФормаЗаписать");
	ЭлементыСтрокиДереваРасположенияКоманды.Добавить("ФормаПроведение");
	Для Каждого ЭлементСтрокиДерева Из ЭлементыСтрокиДереваРасположенияКоманды Цикл
		ЭлементКоманды = Элемент.ПодчиненныеЭлементы.Найти(ЭлементСтрокиДерева);
		ОтключитьВидимостьЭлемента(ЭлементКоманды);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтключитьВидимостьЭлемента(Элемент)
	
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.Видимость = Ложь;
	
КонецПроцедуры

Процедура НастроитьКонтекстноеМеню(Форма)
	
	Элемент = ЭлементВДереве(
		Форма.Элементы.Список.КонтекстноеМеню, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("СписокКонтекстноеМенюГруппа"));
	
	ЭлементКУдалению = ЭлементВДереве(
		Элемент, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("СписокКонтекстноеМенюИзменитьВыделенные"));
	ОтключитьВидимостьЭлемента(ЭлементКУдалению);
	
	ЭлементыДереваРасположенияКоманды = Новый Массив;
	ЭлементыДереваРасположенияКоманды.Добавить("СписокКонтекстноеМенюПроведение");
	ЭлементыДереваРасположенияКоманды.Добавить("СписокКонтекстноеМенюОтменаПроведения");
	
	ЭлементКУдалению = ЭлементВДереве(Элемент, ЭлементыДереваРасположенияКоманды);
	ОтключитьВидимостьЭлемента(ЭлементКУдалению);
	
КонецПроцедуры

Функция ЭлементГруппаКомандКоманднойПанели(Форма, ИмяГруппыКоманд = "", ГруппаКнопкиКоманднойПанели = Неопределено)
	
	Если ГруппаКнопкиКоманднойПанели <> Неопределено Тогда
		Элемент = ГруппаКнопкиКоманднойПанели;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "КоманднаяПанель") Тогда
		Элемент = Форма.КоманднаяПанель;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ЭлементыДереваРасположенияКоманды = Новый Массив;
	Если ГруппаКнопкиКоманднойПанели = Неопределено Тогда
		ЭлементыДереваРасположенияКоманды.Добавить("ГруппаКнопкиКоманднойПанели");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ИмяГруппыКоманд) Тогда
		ЭлементыДереваРасположенияКоманды.Добавить(ИмяГруппыКоманд);
	КонецЕсли;
	
	Элемент = ЭлементВДереве(Элемент, ЭлементыДереваРасположенияКоманды);
	
	Возврат Элемент;
	
КонецФункции

Функция ЭлементВДереве(ЭлементГруппаФормы, ЭлементыДереваРасположенияКоманды)
	
	Если ЭлементГруппаФормы = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Элемент = ЭлементГруппаФормы;
	КонецЕсли;
	
	Для Каждого ЭлементСтрокиДерева Из ЭлементыДереваРасположенияКоманды Цикл
		Элемент = Элемент.ПодчиненныеЭлементы.Найти(ЭлементСтрокиДерева);
		Если Элемент = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Элемент;
	
КонецФункции

#КонецОбласти

#КонецОбласти
