#Область СлужебныйПрограммныйИнтерфейс

// Формирует краткое представление из полного имени физического лица.
//
// Параметры:
//  ФамилияИмяОтчество - Строка - полное имя в виде "Фамилия Имя Отчество";
//                     - Структура - части полного имени:
//                        * Фамилия  - Строка - фамилия;
//                        * Имя      - Строка - имя;
//                        * Отчество - Строка - отчество.
//
// Возвращаемое значение:
//  Строка - фамилия и инициалы. Например, "Пупкин В. И.".
//
// Пример:
//  ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалыФизЛица("Пупкин Василий Иванович") -> "Пупкин В. И."; 
//
Функция ФамилияИнициалы(Знач ФамилияИмяОтчество) Экспорт
	
	Если ТипЗнч(ФамилияИмяОтчество) = Тип("Структура")
		Или ТипЗнч(ФамилияИмяОтчество) = Тип("ФиксированнаяСтруктура") Тогда
		
		Фамилия = ФамилияИмяОтчество.Фамилия;
		Если Не ПустаяСтрока(Фамилия) Тогда
			
			Имя = ФамилияИмяОтчество.Имя;
			
			Имена = СоставныеЧастиИмени(Имя);
			Если Имена.Количество() > 1 Тогда
				
				ФамилияИО = Фамилия + " "
					+ Лев(Имена[0], 1) + ".-"
					+ Лев(Имена[1], 1) + ".";
				
				Отчество = ФамилияИмяОтчество.Отчество;
				Если Не ПустаяСтрока(Отчество) Тогда
					ФамилияИО = ФамилияИО + " " + Лев(Отчество, 1) + ".";
				КонецЕсли; 
				
				Возврат ФамилияИО;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФамилияИмяОтчество);
	
КонецФункции

// Формирует краткое представление имени физического лица.
//
// Параметры:
//  Имя - Строка - имя;
//
// Возвращаемое значение:
//  Строка - инициал имени. 
//
// Пример:
//  ФизическиеЛицаЗарплатаКадрыКлиентСервер.ИнициалыИмени("Василий") -> "В.".
//  ФизическиеЛицаЗарплатаКадрыКлиентСервер.ИнициалыИмени("Анна-Мария") -> "А.-М.".
//  ФизическиеЛицаЗарплатаКадрыКлиентСервер.ИнициалыИмени("Иоганн Себастьян") -> "И.-С."
//
Функция ИнициалыИмени(Знач Имя) Экспорт
	
	Инициалы = "";
	
	Если Не ПустаяСтрока(Имя) Тогда
		
		Имена = СоставныеЧастиИмени(Имя);
		Если Имена.Количество() > 1 Тогда
			
			Инициалы = Лев(Имена[0], 1) + ".-"
				+ Лев(Имена[1], 1) + ".";
			
		Иначе
			Инициалы = Лев(Имя, 1) + ".";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Инициалы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоставныеЧастиИмени(Знач Имя)
	
	Имена = Новый Массив;
	
	Если Не ПустаяСтрока(Имя) Тогда
		
		РазделительИмен = "-";
		ПозицияРазделителя = СтрНайти(Имя, РазделительИмен);
		Если ПозицияРазделителя = 0 Тогда
			РазделительИмен = " ";
			ПозицияРазделителя = СтрНайти(Имя, РазделительИмен);
		КонецЕсли;
		
		Имена = СтрРазделить(Имя, РазделительИмен, Ложь);
		
	КонецЕсли;
	
	Возврат Имена;
	
КонецФункции

#КонецОбласти
