#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА

#Область ПроцедурыИФункцииФормированияОтчета

// Процедура формирует отчет.
Процедура СформироватьОтчет(СтруктураПараметровОтчета, АдресХранилища) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = Отчеты.УПЖКХ_ОтчетОПотребленииЭлектроэнергии.ПолучитьМакет("МакетОтчета");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.Заполнить(СтруктураПараметровОтчета);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ОбластьДополнительныеСведения = Макет.ПолучитьОбласть("ДополнительныеСведения");
	ОбластьДополнительныеСведения.Параметры.Заполнить(СтруктураПараметровОтчета);
	ТабличныйДокумент.Вывести(ОбластьДополнительныеСведения);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьСтрокаКромеПенсионеров = Макет.ПолучитьОбласть("СтрокаКромеПенсионеров");
	ОбластьСтрокаКромеПенсионеров.Параметры.Заполнить(СтруктураПараметровОтчета);
	ТабличныйДокумент.Вывести(ОбластьСтрокаКромеПенсионеров);
	
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	
	ТаблицаПоказаний = СтруктураПараметровОтчета.ТаблицаПоказаний;
	Для Каждого ТекСтрока Из ТаблицаПоказаний Цикл
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ТекСтрока);
		ОбластьСтрокаТаблицы.Параметры.КоэффициентД = СтруктураПараметровОтчета.КоэффициентД;
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла;
	
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьПодвалТаблицы.Параметры.Заполнить(СтруктураПараметровОтчета);
	ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
	
	ОбластьОтветственный = Макет.ПолучитьОбласть("Ответственный");
	ОбластьОтветственный.Параметры.Заполнить(СтруктураПараметровОтчета);
	ТабличныйДокумент.Вывести(ОбластьОтветственный);
	
	// Присвоим имя для сохранения параметров печати табличного документа
	ТабличныйДокумент.ИмяПараметровПечати = "УПЖКХ_ОтчетОПотребленииЭлектроэнергии";
	
	ПоместитьВоВременноеХранилище(ТабличныйДокумент, АдресХранилища);
	
КонецПроцедуры // СформироватьОтчет()

#КонецОбласти

#КонецЕсли