
#Область ВспомогательныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
// Управляет видимостью элементов формы.
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.СсылкаНаПараметрыРассылки.Доступность = Форма.УПЖКХ_ИспользоватьРассылкуКвитанцийПоЭлектроннойПочте;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события "ПриСозданииНаСервере" формы.
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// НАЧИСЛЕНИЯ
	КВП_ИспользоватьФункционалРасчетаНачислений = Константы.КВП_ИспользоватьФункционалРасчетаНачислений.Получить();
	
	// ПЛАТЕЖНЫЕ ДОКУМЕНТЫ
	УПЖКХ_ИспользоватьРассылкуКвитанцийПоЭлектроннойПочте = Константы.УПЖКХ_ИспользоватьРассылкуКвитанцийПоЭлектроннойПочте.Получить();
	
	// ЛЬГОТЫ
	УПЖКХ_ИспользоватьФункционалВыгрузкиВГЦЖС = Константы.УПЖКХ_ИспользоватьФункционалВыгрузкиВГЦЖС.Получить();
	
	// ТСЖ
	УПЖКХ_ИспользоватьФункционалТСЖ = Константы.УПЖКХ_ИспользоватьФункционалТСЖ.Получить();
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

/////////////////////////////////////////
// НАЧИСЛЕНИЯ

&НаКлиенте
// Обработчик события "ПриИзменении" поля "КВП_ИспользоватьФункционалРасчетаНачислений".
Процедура КВП_ИспользоватьФункционалРасчетаНачисленийПриИзменении(Элемент)
	УстановитьНовоеЗначениеКонстантеИспользоватьФункционалРасчетаНачислений();
КонецПроцедуры

/////////////////////////////////////////
// ПЛАТЕЖНЫЕ ДОКУМЕНТЫ

&НаКлиенте
// Обработчик события "ПриИзменении" поля "РассылкаПоЭлектроннойПочте".
Процедура УПЖКХ_ИспользоватьРассылкуПоЭлектроннойПочтеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
	УстановитьНовоеЗначениеКонстантеВедетсяРассылкаПоЭлектроннойПочте();
	
КонецПроцедуры

&НаКлиенте
// Обработчик события "Нажатие" декорации "СсылкаНаПараметрыРассылки".
Процедура СсылкаНаПараметрыРассылкиНажатие(Элемент)
	
	ОткрытьФорму("ОбщаяФорма.УПЖКХ_НастройкиПараметровРассылкиКвитанций",, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
// Обработчик события "Нажатие" декорации "СсылкаНаСтопЛист".
Процедура СсылкаНаСтопЛистНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.УПЖКХ_СтопЛистРассылкиКвитанций.ФормаСписка",, ЭтаФорма);
	
КонецПроцедуры

/////////////////////////////////////////
// ЛЬГОТЫ

&НаКлиенте
// Обработчик события "ПриИзменении" поля "УПЖКХ_ИспользоватьФункционалВыгрузкиВГЦЖС".
Процедура УПЖКХ_ИспользоватьФункционалВыгрузкиВГЦЖСПриИзменении(Элемент)
	УстановитьНовоеЗначениеКонстантеИспользоватьФункционалВыгрузкиВГЦЖС();
КонецПроцедуры

/////////////////////////////////////////
// ТСЖ

&НаКлиенте
// Обработчик события "ПриИзменении" поля "УПЖКХ_ИспользоватьФункционалТСЖ".
Процедура УПЖКХ_ИспользоватьФункционалТСЖПриИзменении(Элемент)
	УстановитьНовоеЗначениеКонстантеИспользоватьФункционалТСЖ();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

/////////////////////////////////////////
// НАЧИСЛЕНИЯ

&НаСервере
// Устаналивает новое значение константе "КВП_ИспользоватьФункционалРасчетаНачислений".
Процедура УстановитьНовоеЗначениеКонстантеИспользоватьФункционалРасчетаНачислений()
	Константы.КВП_ИспользоватьФункционалРасчетаНачислений.Установить(КВП_ИспользоватьФункционалРасчетаНачислений);
КонецПроцедуры

/////////////////////////////////////////
// ПЛАТЕЖНЫЕ ДОКУМЕНТЫ

&НаСервере
// Устаналивает новое значение константе "УПЖКХ_ВедетсяРассылкаПоЭлектроннойПочте".
Процедура УстановитьНовоеЗначениеКонстантеВедетсяРассылкаПоЭлектроннойПочте()
	Константы.УПЖКХ_ИспользоватьРассылкуКвитанцийПоЭлектроннойПочте.Установить(УПЖКХ_ИспользоватьРассылкуКвитанцийПоЭлектроннойПочте);
КонецПроцедуры

/////////////////////////////////////////
// ЛЬГОТЫ

&НаСервере
// Устаналивает новое значение константе "УПЖКХ_ИспользоватьФункционалВыгрузкиВГЦЖС".
Процедура УстановитьНовоеЗначениеКонстантеИспользоватьФункционалВыгрузкиВГЦЖС()
	Константы.УПЖКХ_ИспользоватьФункционалВыгрузкиВГЦЖС.Установить(УПЖКХ_ИспользоватьФункционалВыгрузкиВГЦЖС);
КонецПроцедуры

/////////////////////////////////////////
// ТСЖ

&НаСервере
// Устаналивает новое значение константе "УПЖКХ_ИспользоватьФункционалТСЖ".
Процедура УстановитьНовоеЗначениеКонстантеИспользоватьФункционалТСЖ()
	Константы.УПЖКХ_ИспользоватьФункционалТСЖ.Установить(УПЖКХ_ИспользоватьФункционалТСЖ);
КонецПроцедуры

#КонецОбласти

