////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область ПрограммныйИнтерфейс

// Вызывается из переопределяемого модуля.
//
// Параметры:
//  ИсточникиДанных - ТаблицаЗначений - со следующими колонками.
//   * Таблица     - Строка - полное имя объекта метаданных,
//                   например, Метаданные.Документы.ПриходнаяНакладная.ПолноеИмя().
//   * ПолеДаты    - Строка - имя реквизита объекта или табличной части,
//                   например "Дата".
//   * Раздел      - Строка - имя раздела дат запрета, указанного в
//                   процедуре ПриЗаполненииРазделовДатЗапретаИзменения (см. выше).
//   * ПолеОбъекта - Строка - имя реквизита объекта или реквизита табличной части,
//                   например "Организация".
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_ПодготовкаДанныхДляРаскрытия",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_ПодготовкаЭлектронныхПаспортов",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительства",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_СвидетельствоОРегистрацииПоМестуЖительства",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_ДоговорБезвозмездногоПользованияПоМестуЖительства",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ЗаявлениеОРегистрацииПоМестуПребывания",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_СвидетельствоОРегистрацииПоМестуПребывания",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_ДоговорБезвозмездногоПользованияПоМестуПребывания",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_СменаСтепениРодстваФизЛиц",
										"Дата" , "БухгалтерскийУчет", "");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ОткрытиеЛицевогоСчета",
										"Дата" , "БухгалтерскийУчет");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_УправлениеСведениямиДляВзаиморасчетовПоЛицевымСчетам",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ИзменениеЛицевогоСчета",
										"Дата" , "БухгалтерскийУчет");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ИзменениеПаспортныхДанных",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ЗакрытиеЛицевогоСчета",
										"Дата" , "БухгалтерскийУчет");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_УдалитьУправлениеПарковочнымиМестами",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ВводНачальногоСальдо",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_УправлениеУслугами",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_УстановкаТарифов",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_РасчетТарифов",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_УстановкаСчетчика",
										"Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_ВводПоказанийСчетчика",
										"Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_НачислениеПени",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_КорректировкаНачислений",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_НачислениеУслуг",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_НачислениеУслугВСтороннейПрограмме",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_РазовоеНачислениеУслуг",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_ЗакрытиеПериодаПоНачислениямЖКХ",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ОтражениеНачисленийВРеглУчете",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_РегистрацияОплаты",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_КорректировкаВзаиморасчетовЖКХ",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_ОтчетОНачисленияхЗаЖКУ",
										"Дата" , "БухгалтерскийУчет", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_ЗаявлениеНаРассрочку",
										"Дата" , "БухгалтерскийУчет", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_УстановкаЛьгот",
										"Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_УстановкаСкидок",
										"Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_РасчетЛьгот",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_ОтчетОВыпадающихДоходах",
										"Дата" , "БухгалтерскийУчет", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_НачислениеВознаграждения",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_УстановкиПроцентовВознагражденияПоУслугам",
										"Дата" , "БухгалтерскийУчет", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ВводФактическихЗатратНаОбъект",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ВступлениеВТСЖ",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ВыходИзТСЖ",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_СметаТСЖ",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_РаспределениеМатериалов",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_РаспределениеУслугСтороннихОрганизаций",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_РасчетВзносов",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ПланированиеПодомовыхЗатрат",
										"Дата" , "БухгалтерскийУчет", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_ЗаявкаНаВыполнениеРабот",
										"Дата" , "БухгалтерскийУчет", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_УправлениеДоговорамиСПоставщикамиУслуг",
										"Дата" , "БухгалтерскийУчет", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_УстановкаСобственниковПомещений",
										"Дата" , "БухгалтерскийУчет");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_УстановкаСчетовУчетаРасчетов",
										"Дата" , "БухгалтерскийУчет", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_РеестрУчастниковГолосования",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.КВП_Голосование",
										"Дата" , "БухгалтерскийУчет", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_Иск",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_Предупреждение",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_СудебноеСоглашение",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_РегистрацияДоговоровУправленияДомами",
										"Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_УчетПлановРаботУслуг",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_УчетФактовРаботУслуг",
										"Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										"Документ.УПЖКХ_СоставПравленияТСЖИРевизионнойКомиссии",
										"Дата" , "БухгалтерскийУчет", "Организация");
	
КонецПроцедуры

#КонецОбласти