
#Область СлужебныеПроцедурыИФункции

&НаСервере
// Обработчик события "ПриСозданииНаСервере" формы.
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТипПомещения.СписокВыбора.Очистить();
	
	СписокТиповПомещенийДляВыбора = Справочники.УПЖКХ_ВидыПомещений.ПолучитьСписокТиповПомещений();
	Для Каждого ТекущийТипПомещения Из СписокТиповПомещенийДляВыбора Цикл
		Элементы.ТипПомещения.СписокВыбора.Добавить(ТекущийТипПомещения.Значение);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти