#Область ПрограммныйИнтерфейс

Функция ДолжностьПоНаименованию(Знач Наименование) Экспорт
	
	Если ПустаяСтрока(Наименование) Тогда
		Возврат Справочники.Должности.ПустаяСсылка();
	КонецЕсли;
	
	Наименование = СокрЛП(Наименование);
	
	Должность = Справочники.Должности.НайтиПоНаименованию(Наименование, Истина);
	Если Не ЗначениеЗаполнено(Должность) Тогда
		НоваяДолжность = Справочники.Должности.СоздатьЭлемент();
		НоваяДолжность.Наименование        = Наименование;
		НоваяДолжность.НаименованиеКраткое = Наименование;
		НоваяДолжность.Записать();
		Должность = НоваяДолжность.Ссылка;
	КонецЕсли;
	
	Возврат Должность;
	
КонецФункции

#КонецОбласти
