
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДОКУМЕНТА

#Область ОбработчикиСобытийДокумента

// Обработчик события "ОбработкаЗаполнения" документа.
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УПЖКХ_ТиповыеМетодыСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительства") Тогда
		ДокументОснование = ДанныеЗаполнения;
		Если ДанныеЗаполнения.ВидОперации = Перечисления.КВП_ВидыОперацийРегистрацииПоМестуЖительства.Регистрация Тогда
			
			Организация = ДанныеЗаполнения.Организация;
			ЛицевойСчет = ДанныеЗаполнения.ЛицевойСчет;
			Проживающий = ДанныеЗаполнения.Проживающий;
			Комментарий = ДанныеЗаполнения.Комментарий;
			
		Иначе
			// Если вводится на основании заявления о снятии с регистрации,
			// документ не заполняется.
			
			УПЖКХ_ТиповыеМетодыКлиентСервер.СообщитьОбОшибке("В случае снятия с регистрации свидетельство не заполняется!");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события "ОбработкаПроверкиЗаполнения" документа.
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("Проживающий");
	ПроверяемыеРеквизиты.Добавить("ЛицевойСчет");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли