#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ВводНаОсновании = Ложь;
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено Тогда
		Если ТипДанныхЗаполнения = Тип("Структура") 
			И НЕ ДанныеЗаполнения.Свойство("ДанныеЗаполнения") Тогда
			ЗаполнитьПоСтруктуре(ДанныеЗаполнения);
			ВводНаОсновании = Истина;
		ИначеЕсли ТипДанныхЗаполнения = Тип("Массив")
			ИЛИ (ТипДанныхЗаполнения = Тип("Структура")
				И ДанныеЗаполнения.Свойство("ДанныеЗаполнения")) Тогда
			Если ТипДанныхЗаполнения = Тип("Структура") Тогда
				ДанныеЗаполнения = ДанныеЗаполнения.ДанныеЗаполнения;
			КонецЕсли;
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеДивидендов") Тогда
				ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
				ВводНаОсновании = Истина;
			ИначеЕсли ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВКассу") 
				ИЛИ ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплаты") Тогда
				ЗаполнитьПоВедомостям(ДанныеЗаполнения);
				ВводНаОсновании = Истина;
			КонецЕсли;
		ИначеЕсли Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
			ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
			ВводНаОсновании = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения, Истина);
	
	БезЗакрывающихДокументов = УчетДенежныхСредствБП.БезЗакрывающихДокументов(Организация, Дата, ВидОперации);
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	ОплатаВВалюте = ЗначениеЗаполнено(ВалютаДокумента) И ВалютаДокумента <> ВалютаРегламентированногоУчета;
	
	Если НЕ Документы.РасходныйКассовыйОрдер.ЕстьРасшифровкаПлатежа(ВидОперации) Тогда
		РасшифровкаПлатежа.Очистить();
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратПокупателю
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.УплатаНалога
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИзаймам
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратЗайма
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратКредита
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаЗаймаКонтрагенту Тогда
		ОграничениеТипаКонтрагента = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаПодотчетномуЛицу 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаЗаймаРаботнику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаСотрудникуПоДоговоруПодряда Тогда
		ОграничениеТипаКонтрагента = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаДивидендов Тогда
		Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ОграничениеТипаКонтрагента = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
		Иначе
			ОграничениеТипаКонтрагента = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратРозничномуПокупателю Тогда
		ОграничениеТипаКонтрагента = Новый ОписаниеТипов("СправочникСсылка.Склады");
	Иначе
		ОграничениеТипаКонтрагента = Новый ОписаниеТипов("Неопределено");
	КонецЕсли;
	
	Если ОграничениеТипаКонтрагента.Типы().Количество() = 0 Тогда
		Контрагент = Неопределено;
	Иначе
		Контрагент = ОграничениеТипаКонтрагента.ПривестиЗначение(Контрагент);
	КонецЕсли;
	
	Если УчетДенежныхСредствБП.ЗаполнитьДоговорКонтрагента(ЭтотОбъект, ДанныеЗаполнения, ОплатаВВалюте) Тогда
		
		СчетаУчетаВДокументах.ЗаполнитьСтроки(РасшифровкаПлатежа, "РасшифровкаПлатежа", ЭтотОбъект, Документы.РасходныйКассовыйОрдер);
		
	КонецЕсли;
	
	Если (ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратПокупателю
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИзаймам
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратЗайма
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратКредита
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаЗаймаКонтрагенту)
		И ПустаяСтрока(Выдать) И ЗначениеЗаполнено(Контрагент) Тогда
		ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "НаименованиеПолное, Наименование");
		Выдать = ?(ПустаяСтрока(ДанныеКонтрагента.НаименованиеПолное), ДанныеКонтрагента.Наименование, ДанныеКонтрагента.НаименованиеПолное);
	ИначеЕсли (ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаПодотчетномуЛицу
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаЗаймаРаботнику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаСотрудникуПоДоговоруПодряда)
		И (ПустаяСтрока(Выдать) ИЛИ ПустаяСтрока(ПоДокументу)) И ЗначениеЗаполнено(Контрагент) Тогда
		ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, Контрагент, Дата);
		Если ПустаяСтрока(Выдать) Тогда
			Выдать = ДанныеФизЛица.Представление;
		КонецЕсли;
		Если ПустаяСтрока(ПоДокументу) Тогда
			ПоДокументу = ДанныеФизЛица.ПредставлениеДокумента;
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРКО.УплатаНалога Тогда
		ПредпринимательФИО = Справочники.Организации.ФамилияИмяОтчествоПредпринимателя(Организация, Дата);
		Если ПустаяСтрока(Выдать) Тогда
			Выдать = ПредпринимательФИО;
		КонецЕсли;
		ПлатежиВБюджетКлиентСервер.ПривестиКодТерриторииКФорматуПриказа58н(КодОКАТО, Дата);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратРозничномуПокупателю Тогда 
		Выдать = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование");
	КонецЕсли;
	
	ПараметрыУСН = УчетУСН.СтруктураПараметровОбъектаДляУСН(ЭтотОбъект);
	НалоговыйУчетУСН.ЗаполнитьОтражениеДокументаВУСН(ЭтотОбъект, ПараметрыУСН);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата              = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный     = Пользователи.ТекущийПользователь();
	ДокументОснование = Неопределено;
	НомерЧекаККМ      = 0;
	
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратРозничномуПокупателю Тогда
		ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратПокупателю;
	КонецЕсли; 
	
	УстановитьСчетПриВзносеНаличными();
	
	ПроверитьОбновитьРеквизитыПлатежаВБюджет(ОбъектКопирования);
	
	НалоговыйУчетУСН.ПриКопированииДокумента(ЭтотОбъект, ОбъектКопирования);
	
	Если ОбъектКопирования.БезЗакрывающихДокументов Тогда
		БезЗакрывающихДокументов = УчетДенежныхСредствБП.БезЗакрывающихДокументов(Организация, Дата, ВидОперации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	// Отключаем проверку реквизитов шапки
	
	Если ВидОперации <> Перечисления.ВидыОперацийРКО.ОплатаПоставщику
		И ВидОперации <> Перечисления.ВидыОперацийРКО.ВозвратПокупателю
		И ВидОперации <> Перечисления.ВидыОперацийРКО.ВозвратРозничномуПокупателю
		И ВидОперации <> Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИзаймам
		И ВидОперации <> Перечисления.ВидыОперацийРКО.ВозвратЗайма
		И ВидОперации <> Перечисления.ВидыОперацийРКО.ВозвратКредита
		И ВидОперации <> Перечисления.ВидыОперацийРКО.ВыдачаЗаймаКонтрагенту
		И ВидОперации <> Перечисления.ВидыОперацийРКО.УплатаНалога
		И ВидОперации <> Перечисления.ВидыОперацийРКО.ВыдачаПодотчетномуЛицу
		И ВидОперации <> Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику
		И ВидОперации <> Перечисления.ВидыОперацийРКО.ВыплатаДепонентов
		И ВидОперации <> Перечисления.ВидыОперацийРКО.ВыдачаЗаймаРаботнику
		И ВидОперации <> Перечисления.ВидыОперацийРКО.ВыплатаСотрудникуПоДоговоруПодряда Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетОрганизации");
	ИначеЕсли НЕ Справочники.БанковскиеСчета.ИспользуетсяНесколькоБанковскихСчетовОрганизации(Организация) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетОрганизации");
		ПроверкаРеквизитовОрганизации.ОбработкаПроверкиЗаполнения(
			Организация,
			СчетОрганизации,
			Ложь,
			Отказ);
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.ВидыОперацийРКО.УплатаНалога Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("СчетКонтрагента");
		
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.ВидыОперацийРКО.ВозвратЗайма
		ИЛИ ВидОперации <> Перечисления.ВидыОперацийРКО.ВозвратКредита Тогда
		МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.ВидПлатежаПоКредитамЗаймам");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийРКО.УплатаНалога Тогда
		
		Если Не Справочники.ВидыНалоговИПлатежейВБюджет.ОрганизацияМожетУплачиватьНалог(Налог, Организация) Тогда
			
			ДопустимыйВидОрганизации = ?(ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация),
				НСтр("ru = 'физическими лицами'"),
				НСтр("ru = 'организациями'"));
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Выбранный налог (взнос) уплачивается %1'"), ДопустимыйВидОрганизации);
			
			ТекстОшибкиЗаполнения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Корректность", НСтр("ru = 'Налог'"), , , ТекстСообщения);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибкиЗаполнения, ЭтотОбъект, "Налог", "Объект", Отказ);
			
		КонецЕсли;
		
		Если СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НДСНалоговогоАгента
		   И НалоговыйАгентНДС.Количество() = 0 Тогда
		
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Список", "Заполнение",,, НСтр("ru = 'Расшифровка платежа'"),); 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения, Ссылка, "ПорядокОтраженияБУ",, Отказ);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НалоговыйПериод) Тогда
			КорректныйПериод = ОбщегоНазначенияБПСобытия.КорректныйПериодВводаДокументов();
			Если НалоговыйПериод < КорректныйПериод.НачалоКорректногоПериода
				Или НалоговыйПериод > КорректныйПериод.КонецКорректногоПериода Тогда
				ТекстСообщения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Корректность", НСтр("ru = 'Период'"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "НалоговыйПериод", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("Налог");
		МассивНепроверяемыхРеквизитов.Добавить("ВидНалоговогоОбязательства");
	КонецЕсли;
	
	// Отключаем проверку реквизитов ТЧ РасшифровкаПлатежа
	МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.Сделка");              // Проверяем построчно
	МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов"); // Проверяем построчно
	
	ВидыОперацийСчетаУчета = Документы.РасходныйКассовыйОрдер.ВидыОперацийСчетаУчета();
	Если ВидыОперацийСчетаУчета.Найти(ВидОперации) = Неопределено Тогда
		
		Если ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИзаймам
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратЗайма
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратКредита
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаЗаймаКонтрагенту Тогда
			
			Если НЕ ПолучитьФункциональнуюОпцию("ВестиУчетПоДоговорам") Тогда
				МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.ДоговорКонтрагента");
			КонецЕсли;
			МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.СпособПогашенияЗадолженности");
			МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
			МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.СчетУчетаРасчетовПоАвансам");
			
		Иначе
			
			МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа");
			МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.ДоговорКонтрагента");
			МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.СпособПогашенияЗадолженности");
			МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.СуммаПлатежа");
			МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.СуммаВзаиморасчетов");
			МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.СчетУчетаРасчетовСКонтрагентом");
			МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.СчетУчетаРасчетовПоАвансам");
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Отключаем проверку реквизитов, связанных с выплатой заработной платы
	// Если установлен флаг ручная корректировка - то заполненность полей по заработной плате не проверяем
	
	Если (ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику)
			И НЕ РучнаяКорректировка Тогда
		
		ПроверятьСоответствиеСуммыДокументаИВедомости = ПолучитьФункциональнуюОпцию("ИспользоватьНачислениеЗарплаты")
			ИЛИ ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда.ВидыСубконто.Найти(
					ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций, "ВидСубконто") <> Неопределено;
		
		Если ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПлатежнаяВедомость");
			Если НЕ ПроверятьСоответствиеСуммыДокументаИВедомости Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ВыплатаЗаработнойПлаты.Ведомость");
			КонецЕсли;
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("ВыплатаЗаработнойПлаты");
			МассивНепроверяемыхРеквизитов.Добавить("ВыплатаЗаработнойПлаты.Ведомость");
			МассивНепроверяемыхРеквизитов.Добавить("ВыплатаЗаработнойПлаты.СуммаПлатежа");
			Если НЕ ПроверятьСоответствиеСуммыДокументаИВедомости Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ПлатежнаяВедомость");
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ПроверятьСоответствиеСуммыДокументаИВедомости = Ложь;
		МассивНепроверяемыхРеквизитов.Добавить("ВыплатаЗаработнойПлаты");
		МассивНепроверяемыхРеквизитов.Добавить("ВыплатаЗаработнойПлаты.Ведомость");
		МассивНепроверяемыхРеквизитов.Добавить("ВыплатаЗаработнойПлаты.СуммаКВыплате");
		МассивНепроверяемыхРеквизитов.Добавить("ПлатежнаяВедомость");
		
	КонецЕсли;
	
	// Проверка соответствия суммы документа расшифровке платежа
	
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщику
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратПокупателю
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратРозничномуПокупателю
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИзаймам
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратЗайма
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратКредита
			ИЛИ ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаЗаймаКонтрагенту Тогда
		
		Если РасшифровкаПлатежа.Итог("СуммаПлатежа") <> СуммаДокумента Тогда
			ШаблонСообщения = НСтр("ru = 'Не совпадают сумма документа и ее расшифровка'");
			ТекстСообщения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Корректность", НСтр("ru = 'Сумма документа'"),,, ШаблонСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СуммаДокумента", "Объект", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка соответствия суммы документа и ведомостей на выплату зарплаты
	
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям
			И ПроверятьСоответствиеСуммыДокументаИВедомости Тогда
		
		Если ВыплатаЗаработнойПлаты.Итог("СуммаКВыплате") <> СуммаДокумента Тогда
			ШаблонСообщения = НСтр("ru = 'Не совпадают сумма документа и общая сумма по платежным ведомостям'");
			ТекстСообщения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Корректность", НСтр("ru = 'Сумма документа'"),,, ШаблонСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СуммаДокумента", "Объект", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка соответствия суммы документа и ведомости на выплату зарплаты
	
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику
			И ПроверятьСоответствиеСуммыДокументаИВедомости Тогда
		
		Если ЗначениеЗаполнено(ПлатежнаяВедомость) И ЗначениеЗаполнено(Контрагент) Тогда
			
			Ведомости = Новый Массив;
			Ведомости.Добавить(ПлатежнаяВедомость);
			
			ТаблицаВедомостей = УчетЗарплаты.ПолучитьДанныеВедомостейДляОплатыТаблично(Ссылка, Ведомости, Контрагент);
			
			Если ТаблицаВедомостей.Количество() <> 0 Тогда
				СтрокаВедомости  = ТаблицаВедомостей[0];
				СуммаПоВедомости = СтрокаВедомости.СуммаКВыплате + СтрокаВедомости.КомпенсацияЗаЗадержкуЗарплаты;
			Иначе
				СуммаПоВедомости = 0;
			КонецЕсли;
			
			Если СуммаПоВедомости <> СуммаДокумента Тогда
				ШаблонСообщения = НСтр("ru = 'Не совпадают сумма документа (%1 руб.) и сумма по платежной ведомости (%2 руб.)'");
				ШаблонСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СуммаДокумента, СуммаПоВедомости);
				
				ТекстСообщения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Поле", "Корректность", НСтр("ru = 'Сумма документа'"),,, ШаблонСообщения);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СуммаДокумента", "Объект", Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка соответствия суммы выплаты депонентов с суммой ведомости
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаДепонентов И НЕ РучнаяКорректировка Тогда
		Если ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровВоВнешнейПрограмме")
			И НЕ ПолучитьФункциональнуюОпцию("ВедетсяУчетРасчетовПоЗарплатеСводно")
			ИЛИ ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровСредствамиБухгалтерии") Тогда
			Если ВыплатаДепонентов.Количество() <> 0 Тогда
				СуммаПоВедомостям = ВыплатаДепонентов.Итог("СуммаКВыплате");
				Если ПолучитьФункциональнуюОпцию("УчетЗарплатыИКадровВоВнешнейПрограмме") Тогда
					Если СуммаДокумента <> СуммаПоВедомостям Тогда
						ШаблонСообщения = НСтр("ru = 'Cумма документа (%1 руб.) не равна сумме по платежным ведомостям (%2 руб.)'");
						ШаблонСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СуммаДокумента, СуммаПоВедомостям);
						
						ТекстСообщения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
							"Поле", "Корректность", НСтр("ru = 'Сумма документа'"),,, ШаблонСообщения);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СуммаДокумента", "Объект", Отказ);
					КонецЕсли;
				Иначе
					Если СуммаДокумента < СуммаПоВедомостям Тогда
						ШаблонСообщения = НСтр("ru = 'Cумма документа (%1 руб.) не может быть меньше суммы по платежным ведомостям (%2 руб.)'");
						ШаблонСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, СуммаДокумента, СуммаПоВедомостям);
						
						ТекстСообщения  = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
							"Поле", "Корректность", НСтр("ru = 'Сумма документа'"),,, ШаблонСообщения);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СуммаДокумента", "Объект", Отказ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Соберем все сообщения об ошибках заполнения и выведем их с учетом используемой формы документа.
	СообщенияПроверки = Документы.РасходныйКассовыйОрдер.ПодготовитьСообщенияПроверкиЗаполненияРасшифровкаПлатежа(
		ЭтотОбъект,
		,
		Отказ,
		ПроверяемыеРеквизиты,
		Ложь);
	
	Документы.РасходныйКассовыйОрдер.ОбработкаПроверкиЗаполненияВыплатаЗаработнойПлаты(ЭтотОбъект,, Отказ, ПроверяемыеРеквизиты);
	Документы.РасходныйКассовыйОрдер.ОбработкаПроверкиЗаполненияВыплатаДепонентов(ЭтотОбъект,, Отказ, ПроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	СчетаУчетаВДокументах.ПроверитьЗаполнение(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты,, СообщенияПроверки, Ложь);
	
	Документы.РасходныйКассовыйОрдер.СообщитьРезультатПроверки(
		ЭтотОбъект,
		Отказ,
		СообщенияПроверки,
		Метаданные.Документы.РасходныйКассовыйОрдер.ТабличныеЧасти.РасшифровкаПлатежа);
	
	// Для отдельных видов операций некоторые счета проверяются вне зависимости от настроек пользователя,
	// кроме режима Интеграции с банком
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ПрочийРасход
		И Не ОбщегоНазначенияБП.ЭтоИнтерфейсИнтеграцииСБанком() Тогда
		ПроверяемыеРеквизиты.Добавить("СчетУчетаРасчетовСКонтрагентом");
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыПоКредитамИЗаймам Тогда
		ПроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.СчетУчетаРасчетовСКонтрагентом");
	КонецЕсли;
	
	// Переопределим представление сообщения об ошибке для случая,
	// когда имя и синоним реквизита не соответствуют его роли.
	Сообщили = Новый Массив;
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыРаботнику 
		Или ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям Тогда
		Если ПроверяемыеРеквизиты.Найти("СчетУчетаРасчетовСКонтрагентом") <> Неопределено 
			И Не ЗначениеЗаполнено(СчетУчетаРасчетовСКонтрагентом) Тогда
			
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Счет затрат'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "СчетУчетаРасчетовСКонтрагентом", "Объект", Отказ);
			Сообщили.Добавить("СчетУчетаРасчетовСКонтрагентом");
			
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, Сообщили);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Обновление реквизитов УСН выполняем всегда для учета возможных изменений в учетной политике.
	ПараметрыУСН = УчетУСН.СтруктураПараметровОбъектаДляУСН(ЭтотОбъект);
	Если НЕ УчетУСН.СодержаниеУСНРедактируетсяПользователем(ЭтотОбъект) Тогда
		Содержание_УСН = НалоговыйУчетУСН.СодержаниеОперацииДляКУДиР(ПараметрыУСН);
	КонецЕсли;
	НалоговыйУчетУСН.ЗаполнитьДоходыРасходыВсего(ЭтотОбъект, ПараметрыУСН);
	
	// Обновление счета для вида операции ПолучениеНаличныхВБанке выполняем всегда для учета
	// возможных изменений в учетной политике
	УстановитьСчетПриВзносеНаличными();
	
	// При групповом перепроведении реквизиты документов не меняются,
	// поэтому обновление связанных данных выполнять не требуется.
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Документы.РасходныйКассовыйОрдер.ЕстьРасшифровкаПлатежа(ВидОперации)
		И РасшифровкаПлатежа.Количество() > 0 Тогда
		РаботаСДоговорамиКонтрагентовБП.ЗаполнитьДоговорВТабличнойЧастиПередЗаписью(РасшифровкаПлатежа, ЭтотОбъект);
		ДоговорКонтрагента            = РасшифровкаПлатежа[0].ДоговорКонтрагента;
		СтатьяДвиженияДенежныхСредств = РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
	Иначе
		ДоговорКонтрагента            = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк
		И ЗначениеЗаполнено(Организация) И НЕ ЗначениеЗаполнено(СчетОрганизации)
		И НЕ Справочники.БанковскиеСчета.ИспользуетсяНесколькоБанковскихСчетовОрганизации(Организация) Тогда
		УчетДенежныхСредствБП.УстановитьБанковскийСчет(
			СчетОрганизации, Организация,
			ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета(), Истина);
	КонецЕсли;
	
	СчетаУчетаВДокументах.ЗаполнитьПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнениеЗадачБухгалтера.ПриЗаписиПлатежа(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.РасходныйКассовыйОрдер.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	
	ТаблицаВзаиморасчеты = УчетВзаиморасчетов.ПодготовитьТаблицуВзаиморасчетовПогашениеЗадолженности(
		ПараметрыПроведения.РасшифровкаПлатежа, ПараметрыПроведения.Реквизиты, Отказ);
	
	ТаблицаСуммовыхРазниц = УчетНДС.ПодготовитьТаблицуСуммовыхРазниц(ТаблицаВзаиморасчеты,
		ПараметрыПроведения.Реквизиты, Отказ);
	
	// Структура таблиц для отражения в налоговом учете УСН
	ТаблицаВыплатаЗарплаты    = УчетЗарплаты.ПолучитьТаблицуВыплатыЗарплатыДляУСН(ПараметрыПроведения.ВыплатаЗарплаты);
	ТаблицаВыплатаДепонентов  = УчетЗарплаты.ПолучитьТаблицуВыплатыЗарплатыДляУСН(ПараметрыПроведения.ВыплатаДепонентов);
	СтруктураТаблицУСН        = Новый Структура("ТаблицаРасчетов, ТаблицаВыплатаЗарплаты, ТаблицаВыплатаДепонентов",
		ТаблицаВзаиморасчеты, ТаблицаВыплатаЗарплаты, ТаблицаВыплатаДепонентов);
	
	ТаблицаУплатаТорговогоСбораУСН = УчетУСН.ПодготовитьТаблицуУплатыТорговогоСбораДляРаздела5КУДиР(
		ПараметрыПроведения.РасшифровкаПлатежаПрочее, ПараметрыПроведения.Реквизиты);
	
	// Учет доходов и расходов ИП
	ТаблицыОплатыПоставщикуИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыОплатыПоставщику(
		ТаблицаВзаиморасчеты,
		ПараметрыПроведения.Реквизиты);
		
	ТаблицаОплатыОСиНМА = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуОплатыОСиНМА(
		ТаблицыОплатыПоставщикуИП, 
		ПараметрыПроведения.Реквизиты);
	
	ТаблицаУслугИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуПоступленияМПЗ(
		ПараметрыПроведения.ПоступлениеМПЗИПТаблицаУслуг,
		ПараметрыПроведения.ПоступлениеМПЗИПРеквизиты);
	
	СтруктураТаблицМПЗ = Новый Структура("ТаблицаУслуг", ТаблицаУслугИП);
	
	ТаблицыУплатыВзносовФОТИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыУплатыВзносовФОТ(
		ПараметрыПроведения.ПеречислениеНалогаИПТаблица, ПараметрыПроведения.Реквизиты);
	
	ТаблицыВыплатыЗарплатыИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыВыплатыЗарплаты(
		ПараметрыПроведения.ВыплатаЗарплаты, ПараметрыПроведения.Реквизиты);
	
	ТаблицыВыплатыДепонентовИП = УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицыВыплатыЗарплаты(
		ПараметрыПроведения.ВыплатаДепонентов, ПараметрыПроведения.Реквизиты);
		
	ТаблицыУплатаНалогов = Новый Структура("ПеречислениеНалогов, ПеречислениеНДФЛ",
		ПараметрыПроведения.РасшифровкаПлатежаПрочее, Неопределено);
		
	ТаблицыВыплатаДивидендовФизическомуЛицу = УчетЗарплаты.ПодготовитьТаблицуВыплатаДивидендов(
		ПараметрыПроведения.ВыплатаДивидендов);
	
	Если Не ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		ТаблицаСтатусовСчетов = СтатусыДокументов.ПодготовитьТаблицуСтатусовОплатыСчетов(
			ПараметрыПроведения.ОплатаСчетов, ПараметрыПроведения.Реквизиты);
	КонецЕсли;
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	УчетВзаиморасчетов.СформироватьДвиженияПогашениеЗадолженности(ТаблицаВзаиморасчеты,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетДоходовРасходов.СформироватьДвиженияСуммовыеРазницыРасчетыВУЕ(ТаблицаСуммовыхРазниц,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетЗарплаты.СформироватьДвиженияПеречислениеВыплатаЗарплаты(ЭтотОбъект, ПараметрыПроведения.ВыплатаЗарплаты,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	УчетЗарплаты.СформироватьДвиженияОплатаПоДоговорамПодряда(ЭтотОбъект, ПараметрыПроведения.ОплатаПоДоговорамПодряда,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетЗарплаты.СформироватьДвиженияВыплатаДепонентов(ПараметрыПроведения.ВыплатаДепонентов,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	УставныйКапитал.СформироватьДвиженияВыплатаДивидендов(ПараметрыПроведения.ВыплатаДивидендов,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	УчетЗарплаты.СформироватьДвиженияВыплатаДивидендов(ТаблицыВыплатаДивидендовФизическомуЛицу,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетДенежныхСредств.СформироватьДвиженияПрочееСписание(ПараметрыПроведения.РасшифровкаПлатежаПрочее,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетЗарплаты.СформироватьДвиженияПоНалогамИВзносамСФОТ(ПараметрыПроведения.Реквизиты,
		ТаблицыУплатаНалогов, Движения, Отказ);
	
	УчетНДС.СформироватьДвиженияКурсовыеРазницыНалоговыйАгент(
		ПараметрыПроведения.Реквизиты, ТаблицаВзаиморасчеты, Движения, Отказ);
	
	УчетНДСРаздельный.СформироватьДвиженияКурсовыеРазницыНалоговыйАгент(
		ПараметрыПроведения.Реквизиты, ТаблицаВзаиморасчеты, Движения, Отказ);
	
	НалоговыйУчетУСН.СформироватьДвиженияУСН(ЭтотОбъект, СтруктураТаблицУСН);
	
	УчетУСН.СформироватьДвиженияКУДиРРаздел5(ТаблицаУплатаТорговогоСбораУСН,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	// Учет доходов и расходов ИП
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияОплатаПоставщику(
		ТаблицыОплатыПоставщикуИП,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияПоступлениеМПЗ(СтруктураТаблицМПЗ,
		ПараметрыПроведения.ПоступлениеМПЗИПТаблицаВзаиморасчетов,,
		ПараметрыПроведения.ПоступлениеМПЗИПРеквизиты, Движения, Отказ);
	
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияУплатаНДФЛ(
		ПараметрыПроведения.ПеречислениеНалогаИПТаблица,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияУплатаВзносовФОТ(
		ТаблицыУплатыВзносовФОТИП.СписокВзносов, ТаблицыУплатыВзносовФОТИП.СписокПереплат,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияВыплатаЗарплаты(
		ТаблицыВыплатыЗарплатыИП.СписокВыплат,
		ТаблицыВыплатыЗарплатыИП.СписокПереплат,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияВыплатаЗарплаты(
		ТаблицыВыплатыДепонентовИП.СписокВыплат,
		ТаблицыВыплатыДепонентовИП.СписокПереплат,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	УчетДоходовИРасходовПредпринимателя.РегистрацияСведенийОбОплатеОСиНМА(
		ТаблицаОплатыОСиНМА, ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	// ПЕРЕОЦЕНКА ВАЛЮТНЫХ ОСТАТКОВ
	ТаблицаПереоценка = УчетДоходовРасходов.ПодготовитьТаблицуПереоценкиДвиженийДокумента(
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетДоходовРасходов.СформироватьДвиженияПереоценкаВалютныхОстатков(ТаблицаПереоценка,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетУСН.СформироватьДвиженияПереоценкаВалютныхОстатков(ТаблицаПереоценка,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	СтатусыДокументов.СформироватьДвиженияОплатаСчетов(
		ПараметрыПроведения.ОплатаСчетов, ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	Если Не ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		СтатусыДокументов.СформироватьДвиженияСтатусовДокументов(
			ТаблицаСтатусовСчетов, ПараметрыПроведения.Реквизиты);
	КонецЕсли;

	// Отложенные расчеты с контрагентами.
	УчетВзаиморасчетовОтложенноеПроведение.ЗарегистрироватьОтложенныеРасчетыСКонтрагентами(
		ЭтотОбъект, Отказ, ПараметрыПроведения.РасчетыСКонтрагентамиОтложенноеПроведение);
		
	// Регистрация в последовательности
	РаботаСПоследовательностями.ЗарегистрироватьОтложенныеРасчетыВПоследовательности(
		ЭтотОбъект, Отказ, ПараметрыПроведения.РасчетыСКонтрагентамиОтложенноеПроведение);
	
	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
	РаботаСПоследовательностями.ОтменитьРегистрациюВПоследовательности(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьОбновитьРеквизитыПлатежаВБюджет(ОбъектКопирования)
	
	ПлатежиВБюджетКлиентСервер.ПривестиКодТерриторииКФорматуПриказа58н(КодОКАТО, Дата);
	
	Если ВидОперации <> Перечисления.ВидыОперацийРКО.УплатаНалога
		ИЛИ НЕ ЗначениеЗаполнено(Налог) ИЛИ Налог = Справочники.ВидыНалоговИПлатежейВБюджет.ПрочиеНалогиИСборы Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПлатежиВБюджетКлиентСервер.ДействуетПриказ2017_90н(Дата)
		ИЛИ ПлатежиВБюджетКлиентСервер.ДействуетПриказ2017_90н(ОбъектКопирования.Дата) = ПлатежиВБюджетКлиентСервер.ДействуетПриказ2017_90н(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	НеактуальныеНалоги = ПлатежиВБюджетКлиентСерверПереопределяемый.НеактуальныеНалоги(Дата);
	ВидНалога = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Налог, "ВидНалога");
	Если НеактуальныеНалоги[ВидНалога] <> Неопределено Тогда
		Если НеактуальныеНалоги[ВидНалога].Свойство("АктуальныйНалог") Тогда
			АктуальныйНалог = НеактуальныеНалоги[ВидНалога].АктуальныйНалог;
			Налог = Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоВиду(АктуальныйНалог);
		Иначе
			Если НЕ Справочники.ВидыНалоговИПлатежейВБюджет.РеквизитыАктуальны(Налог, Дата) Тогда
				Справочники.ВидыНалоговИПлатежейВБюджет.ОбновитьПоставляемыеДанныеИзКлассификатора();
			КонецЕсли;
		КонецЕсли;
		
		РегистрацияВНалоговомОргане = Документы.РасходныйКассовыйОрдер.ПолучитьРегистрациюВНалоговомОргане(ЭтотОбъект);
		РеквизитыВБюджетПоУмолчанию = Документы.РасходныйКассовыйОрдер.РеквизитыПлатежногоПорученияВБюджетПоУмолчанию(
			Дата,
			Организация,
			Налог,
			ВидНалоговогоОбязательства,
			РегистрацияВНалоговомОргане);
		
		Если ЗначениеЗаполнено(РеквизитыВБюджетПоУмолчанию.Получатель) И Контрагент <> РеквизитыВБюджетПоУмолчанию.Получатель Тогда
			ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент,
				"ГосударственныйОрган, ВидГосударственногоОргана");
			Если НЕ ЗначениеЗаполнено(Контрагент)
				ИЛИ ДанныеКонтрагента.ГосударственныйОрган
				И ДанныеКонтрагента.ВидГосударственногоОргана <> Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган Тогда
				Контрагент      = РеквизитыВБюджетПоУмолчанию.Получатель;
				СчетКонтрагента = РеквизитыВБюджетПоУмолчанию.СчетПолучателя;
			КонецЕсли;
		КонецЕсли;
		
		Если СтатусСоставителя = ПлатежиВБюджетКлиентСервер.СтатусПлательщикаИныеПлатежи() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыВБюджетПоУмолчанию);
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыВБюджетПоУмолчанию,, "СтатусСоставителя");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет установленные курсы валют документа перед пересчетом сумм
// Нулевые курсы устанавливаются в 1
//
Процедура ПроверкаКурсовВалют(СтрокаПлатеж) Экспорт
	
	КурсДокумента      = ?(КурсДокумента      = 0, 1, КурсДокумента);
	КратностьДокумента = ?(КратностьДокумента = 0, 1, КратностьДокумента);
	
	СтрокаПлатеж.КурсВзаиморасчетов      = ?(СтрокаПлатеж.КурсВзаиморасчетов      = 0, 1, СтрокаПлатеж.КурсВзаиморасчетов);
	СтрокаПлатеж.КратностьВзаиморасчетов = ?(СтрокаПлатеж.КратностьВзаиморасчетов = 0, 1, СтрокаПлатеж.КратностьВзаиморасчетов);
	
КонецПроцедуры

// Заполняет документ на основании массива ведомостей на выплату зарплаты
//
Процедура ЗаполнитьПоВедомостям(ПлатежныеВедомости)
	
	ВидОперации = Перечисления.ВидыОперацийРКО.ВыплатаЗаработнойПлатыПоВедомостям;
	
	ПлатежнаяВедомость = ПлатежныеВедомости[0];
	
	ДокументОснование  = ПлатежнаяВедомость;
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежнаяВедомость, "Организация");
	Если ПлатежныеВедомости.Количество() = 1 Тогда
		Если ТипЗнч(ПлатежнаяВедомость) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплаты") Тогда
			ПодразделениеОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежнаяВедомость, "ПодразделениеОрганизации");
		Иначе
			ПодразделениеОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежнаяВедомость, "Подразделение");
		КонецЕсли;
	КонецЕсли;
	
	УчетЗарплатыИКадровВоВнешнейПрограмме = Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить();
	
	ТаблицаВедомостей = УчетЗарплаты.ПолучитьДанныеВедомостейДляОплатыТаблично(Ссылка, ПлатежныеВедомости);
	
	ТаблицаВедомостей.Свернуть("Ведомость", "СуммаКВыплате, КомпенсацияЗаЗадержкуЗарплаты");
	
	Если ТаблицаВедомостей.Количество() = 0 Тогда
		Если УчетЗарплатыИКадровВоВнешнейПрограмме Тогда
			Если ПлатежныеВедомости.Количество() > 1 Тогда
				ТекстСообщения = НСтр("ru = 'По выбранным документам нет сумм к выплате!'");
			Иначе
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В документе %1 нет сумм к выплате!'"), ПлатежнаяВедомость.Ссылка);
			КонецЕсли;
		Иначе
			Если ПлатежныеВедомости.Количество() > 1 Тогда
				ТекстСообщения = НСтр("ru = 'Выбранные документы полностью оплачены!'");
			Иначе
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ %1 полностью оплачен!'"), ПлатежнаяВедомость.Ссылка);
			КонецЕсли;
		КонецЕсли;
		
		ВызватьИсключение ТекстСообщения;
	Иначе
		Для каждого СтрокаВедомости Из ТаблицаВедомостей Цикл
			
			Если УчетЗарплатыИКадровВоВнешнейПрограмме Тогда
				Если СтрокаВедомости.Ведомость.ВидМестаВыплаты <> Перечисления.ВидыМестВыплатыЗарплаты.Касса
					И СтрокаВедомости.Ведомость.ВидМестаВыплаты <> Перечисления.ВидыМестВыплатыЗарплаты.Раздатчик Тогда
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Документ %1 оплачивается через банк!'"), СтрокаВедомости.Ведомость);
					ВызватьИсключение ТекстСообщения;
					
				КонецЕсли;
			КонецЕсли;
			
			СтрокаВедомость = ВыплатаЗаработнойПлаты.Добавить();
			СтрокаВедомость.Ведомость = СтрокаВедомости.Ведомость;
			СтрокаВедомость.СуммаКВыплате = СтрокаВедомости.СуммаКВыплате + СтрокаВедомости.КомпенсацияЗаЗадержкуЗарплаты;
		КонецЦикла;
	КонецЕсли;
	
	СуммаДокумента = ТаблицаВедомостей.Итог("СуммаКВыплате") + ТаблицаВедомостей.Итог("КомпенсацияЗаЗадержкуЗарплаты");
	РасшифровкаПлатежа.Добавить().СуммаПлатежа = СуммаДокумента;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуОснованию(Основание)
	
	// Заполнение реквизитов из стандартного набора по документу основанию.
	ЗаполнениеДокументов.ЗаполнитьПоОснованию(ЭтотОбъект, Основание);
	ДокументОснование = Основание;
	
	ТипЗначенияОснования = ТипЗнч(Основание);
	
	Если ТипЗначенияОснования <> Тип("ДокументСсылка.АвансовыйОтчет")
		И ТипЗначенияОснования <> Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
		И ТипЗначенияОснования <> Тип("ДокументСсылка.НачислениеДивидендов") Тогда
		ВалютаВзаиморасчетовДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Основание.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ВалютаДокумента    = ВалютаРегламентированногоУчета;
		КурсДокумента      = 1;
		КратностьДокумента = 1;
	КонецЕсли;
	
	Если ТипЗначенияОснования = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
		ИЛИ ТипЗначенияОснования = Тип("ДокументСсылка.ПоступлениеДопРасходов") 
		ИЛИ ТипЗначенияОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")
		ИЛИ ТипЗначенияОснования = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
		ИЛИ ТипЗначенияОснования = Тип("ДокументСсылка.ПоступлениеНМА") 
		ИЛИ ТипЗначенияОснования = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		ИЛИ ТипЗначенияОснования = Тип("ДокументСсылка.СчетНаОплатуПоставщика")
		ИЛИ ТипЗначенияОснования = Тип("ДокументСсылка.ВыкупПредметовЛизинга") Тогда
		
		Если ТипЗначенияОснования = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")  Тогда
			ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратПокупателю;
		Иначе
			ВидОперации = Перечисления.ВидыОперацийРКО.ОплатаПоставщику;
		КонецЕсли;
		
		Контрагент         = Основание.Контрагент;
		ДоговорКонтрагента = Основание.ДоговорКонтрагента;
		ВидРасчетовПоДоговору = БухгалтерскийУчетПереопределяемый.ОпределениеВидаРасчетовПоПараметрамДоговора(ДоговорКонтрагента);
		Если ВидРасчетовПоДоговору = Перечисления.ВидыРасчетовПоДоговорам.РасчетыВИностраннойВалюте Тогда
			ВалютаДокумента = ВалютаВзаиморасчетовДоговора;
		Иначе
			ВалютаДокумента = ВалютаРегламентированногоУчета;
		КонецЕсли;
		
		СтруктураКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		КурсДокумента           = СтруктураКурсаДокумента.Курс;
		КратностьДокумента      = СтруктураКурсаДокумента.Кратность;
		
		СтруктураКурсаВзаиморасчетов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаВзаиморасчетовДоговора, Дата);
		
		ТаблицаПлатежей = РасшифровкаПлатежа.Выгрузить();
		
		Если ТипЗначенияОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			СуммаДокументаОснования = Новый ТаблицаЗначений();
			СуммаДокументаОснования.Колонки.Добавить("СуммаПлатежа", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
			СуммаДокументаОснования.Колонки.Добавить("СтавкаНДС",    Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
			СуммаДокументаОснования.Колонки.Добавить("СуммаНДС",     ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
			СтрокаТаблицыСумм = СуммаДокументаОснования.Добавить();
			
			СтрокаТаблицыСумм.СуммаПлатежа = Основание.СуммаВознаграждения;
			СтрокаТаблицыСумм.СтавкаНДС    = Основание.СтавкаНДСВознаграждения;
			СтрокаТаблицыСумм.СуммаНДС     = Основание.Товары.Итог("СуммаНДСВознаграждения");
			Если НЕ Основание.СуммаВключаетНДС Тогда
				СтрокаТаблицыСумм.СуммаПлатежа = СтрокаТаблицыСумм.СуммаПлатежа+СтрокаТаблицыСумм.СуммаНДС;
			КонецЕсли;
		ИначеЕсли ТипЗначенияОснования = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			СуммаДокументаОснования = СтатусыДокументов.ТаблицаСуммКОплатеВРазрезеСтавокНДС(
				Новый Структура("Основание, ДатаОснования, Организация", Основание, Основание.Дата, Основание.Организация),
				УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДСВРазрезеСтавокНДС(Основание));
			СуммаДокументаОснования.Колонки.Сумма.Имя = "СуммаПлатежа";
		Иначе
			СуммаДокументаОснования = УчетНДСПереопределяемый.ПолучитьСуммуДокументаСНДСВРазрезеСтавокНДС(Основание);
			СуммаДокументаОснования.Колонки.Сумма.Имя = "СуммаПлатежа";
			Если ТипЗначенияОснования = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
				Если Основание.ВидОперации = Перечисления.ВидыОперацийОтчетКомитентуОПродажах.ОтчетОПродажах Тогда
					СуммаДокументаОснования.ЗаполнитьЗначения(0, "СуммаНДС");
					СуммаДокументаОснования.ЗаполнитьЗначения(Перечисления.СтавкиНДС.ПустаяСсылка(), "СтавкаНДС");
					Если Основание.УдержатьВознаграждение Тогда 
						СуммаКоррПлатежа = СуммаДокументаОснования.Итог("СуммаПлатежа") - Основание.СуммаВознаграждения;
						НоваяКолонкаСумм = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СуммаКоррПлатежа,
							СуммаДокументаОснования.ВыгрузитьКолонку("СуммаПлатежа"));
						Если НоваяКолонкаСумм <> Неопределено Тогда
							СуммаДокументаОснования.ЗагрузитьКолонку(НоваяКолонкаСумм, "СуммаПлатежа");
						КонецЕсли;
						
						Если НЕ Основание.СуммаВключаетНДС Тогда
							СуммаКоррНДС    = СуммаДокументаОснования.Итог("СуммаПлатежа") - Основание.Товары.Итог("СуммаНДСВознаграждения");
							НоваяКолонкаНДС = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СуммаКоррНДС,
								СуммаДокументаОснования.ВыгрузитьКолонку("СуммаПлатежа"));
							Если НоваяКолонкаНДС <> Неопределено Тогда
								СуммаДокументаОснования.ЗагрузитьКолонку(НоваяКолонкаНДС, "СуммаПлатежа");
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ДоговорКонтрагента)
							И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "УчетАгентскогоНДС") Тогда
						СуммаКоррНДС    = СуммаДокументаОснования.Итог("СуммаПлатежа") - Основание.Товары.Итог("СуммаНДС");
						НоваяКолонкаНДС = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(
							СуммаКоррНДС, СуммаДокументаОснования.ВыгрузитьКолонку("СуммаПлатежа"));
						Если НоваяКолонкаНДС <> Неопределено Тогда
							СуммаДокументаОснования.ЗагрузитьКолонку(НоваяКолонкаНДС, "СуммаПлатежа");
						КонецЕсли;
					КонецЕсли;
				Иначе
					СуммаДокументаОснования.Очистить();
				КонецЕсли;
			ИначеЕсли ТипЗначенияОснования = Тип("ДокументСсылка.ПоступлениеДопРасходов") Тогда
				Если НЕ (Основание.Сумма = 0 И Основание.СуммаНДС = 0) Тогда
					Если СуммаДокументаОснования.Количество() = 0 Тогда
						СтрокаТаблицыСумм = СуммаДокументаОснования.Добавить();
					Иначе
						СтрокаТаблицыСумм = СуммаДокументаОснования[0];
					КонецЕсли;
					
					СтрокаТаблицыСумм.СуммаПлатежа = СтрокаТаблицыСумм.СуммаПлатежа + Основание.Сумма;
					СтрокаТаблицыСумм.СуммаНДС     = СтрокаТаблицыСумм.СуммаНДС     + Основание.СуммаНДС;
					Если НЕ Основание.СуммаВключаетНДС Тогда
						СтрокаТаблицыСумм.СуммаПлатежа = СтрокаТаблицыСумм.СуммаПлатежа + Основание.СуммаНДС;
					КонецЕсли;
				КонецЕсли;
				
				СуммаДокументаОснования.ЗаполнитьЗначения(Основание.СтавкаНДС, "СтавкаНДС");
			КонецЕсли;
		КонецЕсли;
		
		ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(СуммаДокументаОснования, ТаблицаПлатежей);
		Если ТаблицаПлатежей.Количество() = 0 Тогда
			ТаблицаПлатежей.Добавить();
		КонецЕсли;
		
		ТаблицаПлатежей.ЗаполнитьЗначения(ДоговорКонтрагента,                     "ДоговорКонтрагента");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Курс,      "КурсВзаиморасчетов");
		ТаблицаПлатежей.ЗаполнитьЗначения(СтруктураКурсаВзаиморасчетов.Кратность, "КратностьВзаиморасчетов");
		
		// При вводе на основании устанавливаем режим распределения оплаты "По документу",
		// кроме ввода на основании отчета комитенту - задолженность перед комитентом образуется другими документами
		Если ТипЗначенияОснования = Тип("ДокументСсылка.ОтчетКомитентуОПродажах")
			ИЛИ ТипЗначенияОснования = Тип("ДокументСсылка.СчетНаОплатуПоставщика")
			ИЛИ НЕ ПолучитьФункциональнуюОпцию("УправлениеЗачетомАвансовПогашениемЗадолженности") Тогда
			ТаблицаПлатежей.ЗаполнитьЗначения(Перечисления.СпособыПогашенияЗадолженности.Автоматически, "СпособПогашенияЗадолженности");
		Иначе
			ТаблицаПлатежей.ЗаполнитьЗначения(Перечисления.СпособыПогашенияЗадолженности.ПоДокументу, "СпособПогашенияЗадолженности");
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание, "Сделка");
		КонецЕсли;
		
		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			Если ЗначениеЗаполнено(ДоговорКонтрагента)
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "УчетАгентскогоНДС") Тогда
				СтрокаПлатеж.СуммаПлатежа = СтрокаПлатеж.СуммаПлатежа - СтрокаПлатеж.СуммаНДС;
				СтрокаПлатеж.СуммаНДС     = 0;
				СтрокаПлатеж.СтавкаНДС    = Перечисления.СтавкиНДС.ПустаяСсылка();
			КонецЕсли;
		КонецЦикла;
		
		Если ТипЗначенияОснования = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			
			СчетНаОплатуПоставщика = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "СчетНаОплатуПоставщика");
			ТаблицаПлатежей.ЗаполнитьЗначения(СчетНаОплатуПоставщика, "СчетНаОплату");
			
		КонецЕсли;
		
		ТаблицаПлатежей.ЗагрузитьКолонку(ТаблицаПлатежей.ВыгрузитьКолонку("СуммаПлатежа"), "СуммаВзаиморасчетов");
		
		Для каждого СтрокаПлатеж Из ТаблицаПлатежей Цикл
			ПроверкаКурсовВалют(СтрокаПлатеж);
			Если ЗначениеЗаполнено(ДоговорКонтрагента)
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "РасчетыВУсловныхЕдиницах") Тогда
				Если Основание.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
					СтрокаПлатеж.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаПлатежа,
						ВалютаРегламентированногоУчета, ВалютаВзаиморасчетовДоговора,
						1, Основание.КурсВзаиморасчетов, 1, Основание.КратностьВзаиморасчетов);
					СтрокаПлатеж.СуммаНДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаНДС,
						ВалютаРегламентированногоУчета, ВалютаВзаиморасчетовДоговора,
						1, Основание.КурсВзаиморасчетов, 1, Основание.КратностьВзаиморасчетов);
				КонецЕсли;
				
				СтрокаПлатеж.СуммаПлатежа = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов,
					ВалютаВзаиморасчетовДоговора, ВалютаРегламентированногоУчета,
					СтрокаПлатеж.КурсВзаиморасчетов, 1, СтрокаПлатеж.КратностьВзаиморасчетов, 1);
				ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаПлатеж.СтавкаНДС);
				СтрокаПлатеж.СуммаНДС = Окр(УчетНДСКлиентСервер.РассчитатьСуммуНДС(
					СтрокаПлатеж.СуммаПлатежа, Истина, ЗначениеСтавкиНДС), 2);
			КонецЕсли;
		КонецЦикла;
		
		Если ТипЗначенияОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовЗаПосредническиеУслуги, "СчетУчетаРасчетовСКонтрагентом");
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовПоАвансамВыданным,      "СчетУчетаРасчетовПоАвансам");
			
		ИначеЕсли ТипЗначенияОснования = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			Если Основание.УдержатьВознаграждение Тогда
				ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовПоАвансам, "СчетУчетаРасчетовСКонтрагентом");
			КонецЕсли;
			
			ТаблицаПлатежей.ЗагрузитьКолонку(
				ТаблицаПлатежей.ВыгрузитьКолонку("СчетУчетаРасчетовСКонтрагентом"), "СчетУчетаРасчетовПоАвансам");
				
		ИначеЕсли ТипЗначенияОснования = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда	
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание, "СчетНаОплату");
		ИначеЕсли ТипЗначенияОснования <> Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовСКонтрагентом, "СчетУчетаРасчетовСКонтрагентом");
			ТаблицаПлатежей.ЗаполнитьЗначения(Основание.СчетУчетаРасчетовПоАвансам,     "СчетУчетаРасчетовПоАвансам");
			
		КонецЕсли;
		
		РасшифровкаПлатежа.Загрузить(ТаблицаПлатежей);
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		СтрокаПлатеж   = РасшифровкаПлатежа[0];
		
	ИначеЕсли ТипЗначенияОснования = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		
		ЗаполнитьПоПКО();
		
	ИначеЕсли ТипЗначенияОснования = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		
		ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаПодотчетномуЛицу;
		Контрагент  = Основание.ФизЛицо;
		
		ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(
			Основание.Организация, Основание.ФизЛицо, Дата, Ложь);
		Выдать = ДанныеФизЛица.Представление;
		ПоДокументу = ДанныеФизЛица.ПредставлениеДокумента;
		
		ШаблонОснования = "Выдача перерасхода по авансовому отчету %1 от %2";
		ЭтотОбъект.Основание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОснования,
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Основание.Номер, Истина, Ложь),
			Формат(Основание.Дата, "ДФ=dd.MM.yyyy"));
		
		СуммаАванса = Документы.АвансовыйОтчет.ПолучитьСуммуВыданныхАвансов(Основание);
		ПерерасходАванса = Макс(0, Основание.СуммаДокумента - СуммаАванса);
		СуммаДокумента = ПерерасходАванса;
		
	ИначеЕсли ТипЗначенияОснования = Тип("ДокументСсылка.НачислениеДивидендов") Тогда
		
		ВидОперации          = Перечисления.ВидыОперацийРКО.ВыплатаДивидендов;
		Контрагент           = Основание.Учредитель;
		СуммаДокумента       = Основание.СуммаДохода - Основание.СуммаНалога;
		НачислениеДивидендов = Основание;
		
		Если ЗначениеЗаполнено(НачислениеДивидендов) Тогда
			ПараметрыРасчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "РасчетныйПериод");
			ПериодНачисленияСтрокой = ПредставлениеПериода(НачалоГода(ПараметрыРасчета.РасчетныйПериод),
										КонецКвартала(ПараметрыРасчета.РасчетныйПериод),
										"ФП = Истина");
			ТекстОснование = СтрШаблон(НСтр("ru = 'Выплата дивидендов за %1'"), ПериодНачисленияСтрокой);
		Иначе
			ТекстОснование = НСтр("ru = 'Выплата дивидендов'");
		КонецЕсли;
		
		ЭтотОбъект.Основание = ТекстОснование;
	ИначеЕсли ТипЗначенияОснования = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")  Тогда
		Документы.РасходныйКассовыйОрдер.ЗаполнитьПоОтчетуОРозничныхПродажах(ЭтотОбъект, Основание);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет документ на основании приходного кассового ордера
//
Процедура ЗаполнитьПоПКО()
	
	ИспользуетсяНалогНаПрофессиональныйДоход = ПолучитьФункциональнуюОпцию("ИспользуетсяНалогНаПрофессиональныйДоход");

	ВидОперацииДокументаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ВидОперации");
	Если ВидОперацииДокументаОснования = Перечисления.ВидыОперацийПКО.ОплатаПокупателя Тогда
		
		ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "ВалютаДокумента, Дата, Контрагент");
		
		СтруктураКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОснование.ВалютаДокумента, Дата);
		КурсДокумента      = СтруктураКурсаДокумента.Курс;
		КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		
		СтруктураКурсаОснования = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументОснование.ВалютаДокумента, ДокументОснование.Дата);
		КурсОснования      = СтруктураКурсаОснования.Курс;
		КратностьОснования = СтруктураКурсаОснования.Кратность;
		
		ВидОперации = Перечисления.ВидыОперацийРКО.ВозвратПокупателю;
		Контрагент  = ДокументОснование.Контрагент;
		
		Если ИспользуетсяНалогНаПрофессиональныйДоход Тогда
		
			СведенияОЧекеНПД = РегистрыСведений.ЧекиНПД.СведенияОЧеке(ДокументОснование);
		
			Если ЗначениеЗаполнено(СведенияОЧекеНПД) Тогда
				НомерЧекаНПД = СведенияОЧекеНПД.НомерЧека;
			КонецЕсли;
		
		КонецЕсли;
		
		Для каждого СтрокаОснование Из ДокументОснование.РасшифровкаПлатежа Цикл
			
			СтрокаПлатеж = РасшифровкаПлатежа.Добавить();
			
			СтрокаПлатеж.ДоговорКонтрагента      = СтрокаОснование.ДоговорКонтрагента;
			СтруктураКурсаВзаиморасчетов         = РаботаСКурсамиВалют.ПолучитьКурсВалюты(
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПлатеж.ДоговорКонтрагента, "ВалютаВзаиморасчетов"), Дата);
			СтрокаПлатеж.КурсВзаиморасчетов      = СтруктураКурсаВзаиморасчетов.Курс;
			СтрокаПлатеж.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
			
			СтрокаПлатеж.СуммаПлатежа = СтрокаОснование.СуммаПлатежа;
			
			// При вводе на основании устанавливаем режим распределения оплаты "По документу"
			Если ПолучитьФункциональнуюОпцию("УправлениеЗачетомАвансовПогашениемЗадолженности") Тогда
				СтрокаПлатеж.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.ПоДокументу;
				СтрокаПлатеж.Сделка = ДокументОснование;
			Иначе
				СтрокаПлатеж.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
			КонецЕсли;
			
			СтрокаПлатеж.СтавкаНДС = СтрокаОснование.СтавкаНДС;
			
			СтрокаПлатеж.СчетУчетаРасчетовПоАвансам     = СтрокаОснование.СчетУчетаРасчетовПоАвансам;
			СтрокаПлатеж.СчетУчетаРасчетовСКонтрагентом = СтрокаОснование.СчетУчетаРасчетовСКонтрагентом;
			
		КонецЦикла;
		
		Для Индекс = 0 По ДокументОснование.РасшифровкаПлатежа.Количество() - 1 Цикл
			СтрокаПлатеж    = РасшифровкаПлатежа[Индекс];
			СтрокаОснование = ДокументОснование.РасшифровкаПлатежа[Индекс];
			ВалютаВзаиморасчетовДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОснование.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
			Если ЗначениеЗаполнено(СтрокаПлатеж.ДоговорКонтрагента)
				И СтрокаПлатеж.ДоговорКонтрагента = СтрокаОснование.ДоговорКонтрагента Тогда // Остался договор из основания
				
				СтрокаПлатеж.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаОснование.СуммаПлатежа,
					ДокументОснование.ВалютаДокумента, ВалютаВзаиморасчетовДоговора,
					КурсОснования, СтрокаОснование.КурсВзаиморасчетов,
					КратностьОснования, СтрокаОснование.КратностьВзаиморасчетов);
				
				СтрокаПлатеж.СуммаПлатежа = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаВзаиморасчетов,
					ВалютаВзаиморасчетовДоговора, ВалютаДокумента,
					СтрокаПлатеж.КурсВзаиморасчетов, КурсДокумента,
					СтрокаПлатеж.КратностьВзаиморасчетов,КратностьДокумента);
			Иначе
				Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетовДоговора) Тогда
					СтрокаПлатеж.СуммаВзаиморасчетов = СтрокаПлатеж.СуммаПлатежа;
					СтрокаПлатеж.КурсВзаиморасчетов  = 1;
					СтрокаПлатеж.КратностьВзаиморасчетов = 1;
				Иначе
					СтрокаПлатеж.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаПлатеж.СуммаПлатежа,
						ВалютаДокумента, ВалютаВзаиморасчетовДоговора,
						КурсДокумента, СтрокаПлатеж.КурсВзаиморасчетов,
						КратностьДокумента, СтрокаПлатеж.КратностьВзаиморасчетов);
				КонецЕсли;
			КонецЕсли;
			
			ЗначениеСтавкиНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаПлатеж.СтавкаНДС);
			СтрокаПлатеж.СуммаНДС = СтрокаПлатеж.СуммаПлатежа * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС);
		КонецЦикла;
		
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
	ИначеЕсли ВидОперацииДокументаОснования = Перечисления.ВидыОперацийПКО.РозничнаяВыручка Тогда
		ОплатаВВалюте = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетКасса).Валютный;
		ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		
		ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк;
		
		Если ИспользуетсяНалогНаПрофессиональныйДоход Тогда
		
			СведенияОЧекеНПД = РегистрыСведений.ЧекиНПД.СведенияОЧеке(ДокументОснование);
		
			Если ЗначениеЗаполнено(СведенияОЧекеНПД) Тогда
				НомерЧекаНПД = СведенияОЧекеНПД.НомерЧека;
			КонецЕсли;
		
		КонецЕсли;
		
		СчетУчетаРасчетовСКонтрагентом = ?(ОплатаВВалюте,
			ПланыСчетов.Хозрасчетный.ВалютныеСчета,
			ПланыСчетов.Хозрасчетный.РасчетныеСчета);
		
		НовыйСчетОрганизации = Справочники.БанковскиеСчета.ПустаяСсылка();
		УчетДенежныхСредствБП.УстановитьБанковскийСчет(НовыйСчетОрганизации,
			Организация, ВалютаРегламентированногоУчета, НЕ ОплатаВВалюте);
		
		СчетОрганизации = НовыйСчетОрганизации;
		СуммаДокумента  = ДокументОснование.РасшифровкаПлатежа.Итог("СуммаПлатежа");
	Иначе
		// Документ НЕ вводится на основании ПКО с другими видами операций
		ВидОперации = Перечисления.ВидыОперацийРКО.ПрочийРасход;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	КонецЕсли;
	
	УчетДенежныхСредствБП.ЗаполнитьРеквизитыПлатежногоДокумента(ЭтотОбъект);
	
	Если ВидОперации = Перечисления.ВидыОперацийРКО.УплатаНалога Тогда
		
		Если ДанныеЗаполнения.Свойство("СчетУчета")
			И ДанныеЗаполнения.Свойство("Субконто1")
			И ДанныеЗаполнения.Свойство("Субконто2")
			И ДанныеЗаполнения.Свойство("Субконто3") Тогда
			
			СчетУчетаРасчетовСКонтрагентом = ДанныеЗаполнения.СчетУчета;
			СубконтоДт1 = ДанныеЗаполнения.Субконто1;
			СубконтоДт2 = ДанныеЗаполнения.Субконто2;
			СубконтоДт3 = ДанныеЗаполнения.Субконто3;
			
		КонецЕсли;
		
		ПравилаЗаполнения = ПлатежиВБюджетНастройки.ПравилаЗаполненияРеквизитовПлатежа(Налог);
		
		Если Не ЗначениеЗаполнено(Контрагент) И ПравилаЗаполнения.ЗаполнятьПолучателя Тогда
			
			ВидИКодГосударственногоОргана = ДанныеГосударственныхОрганов.ВидИКодГосударственногоОрганаПоНалогу(
				Налог, Организация, Дата);
			ПолучательПлатежа = Документы.ПлатежноеПоручение.ПолучательДляПлатежаГосударственномуОргану(
				ВидИКодГосударственногоОргана.Вид, ВидИКодГосударственногоОргана.Код);
			
			Контрагент      = ПолучательПлатежа.Контрагент;
			СчетКонтрагента = ПолучательПлатежа.БанковскийСчет;
			
		КонецЕсли;
		
		ИсточникДанныхКонтекста = ПлатежиВБюджетПереопределяемый.НовыйИсточникДанныхКонтекстаПлатежногоДокумента();
		ИсточникДанныхКонтекста.Период = Дата;
		ИсточникДанныхКонтекста.Организация = Организация;
		ИсточникДанныхКонтекста.РегистрацияВНалоговомОргане = Документы.РасходныйКассовыйОрдер.ПолучитьРегистрациюВНалоговомОргане(ЭтотОбъект);
		ИсточникДанныхКонтекста.Получатель = Контрагент;
		ИсточникДанныхКонтекста.СчетПолучателя = СчетКонтрагента;
		ИсточникДанныхКонтекста.Налог = Налог;
		
		// Если в данных заполнения передан Налоговый период, то задаем период платежа.
		ПериодПлатежа = Неопределено;
		Если ДанныеЗаполнения.Свойство("НалоговыйПериод", ПериодПлатежа) И ЗначениеЗаполнено(ПериодПлатежа) Тогда
			НалоговыйПериод = ПериодПлатежа;
		ИначеЕсли ДанныеЗаполнения.Свойство("ВидНалога") Тогда
			Если ПлатежиВБюджетКлиентСерверПереопределяемый.ЭтоФиксированныеВзносы(ДанныеЗаполнения.ВидНалога) Тогда
				НалоговыйПериод = НачалоГода(Дата);
			ИначеЕсли ПлатежиВБюджетКлиентСерверПереопределяемый.ЭтоНалогУСН(ДанныеЗаполнения.ВидНалога) Тогда
				НалоговыйПериод = УчетУСН.РелевантныйПериодНалоговогоПлатежа(Дата, Организация);
			КонецЕсли;
		Иначе
			НалоговыйПериод = НачалоМесяца(ДобавитьМесяц(Дата, -1));
		КонецЕсли;
		
		ИсточникДанныхКонтекста.ПериодПлатежа = НалоговыйПериод;
		
		ДанныеЗаполнения.Свойство("ВидНалоговогоОбязательства", ИсточникДанныхКонтекста.ВидНалоговогоОбязательства);
		Если Не ЗначениеЗаполнено(ИсточникДанныхКонтекста.ВидНалоговогоОбязательства) Тогда
			ИсточникДанныхКонтекста.ВидНалоговогоОбязательства = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		КонецЕсли;
		
		РеквизитыОбъекта = ПлатежиВБюджетКлиентСерверПереопределяемый.НовыеРеквизитыПлатежаВБюджет(ЭтотОбъект);
		Документы.РасходныйКассовыйОрдер.ЗаполнитьРеквизитыПлатежаВБюджетДопустимымиЗначениями(
			РеквизитыОбъекта, ИсточникДанныхКонтекста, ДанныеЗаполнения);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыОбъекта);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСчетПриВзносеНаличными()
	
	Если ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк Тогда
		ИспользоватьПереводыВПути = УчетнаяПолитика.ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств(Организация, Дата);
		ТребуетсяЗаполнение = Ложь;
		Если ИспользоватьПереводыВПути Тогда
			Если СчетУчетаРасчетовСКонтрагентом <> ПланыСчетов.Хозрасчетный.ПереводыВПути
				И СчетУчетаРасчетовСКонтрагентом <> ПланыСчетов.Хозрасчетный.ПереводыВПутиВал Тогда
				ТребуетсяЗаполнение = Истина;
			КонецЕсли;
		Иначе
			СчетаБанка = Документы.РасходныйКассовыйОрдер.СчетаБанка();
			Если СчетаБанка.Найти(СчетУчетаРасчетовСКонтрагентом) = Неопределено Тогда
				ТребуетсяЗаполнение = Истина;
			КонецЕсли;
		КонецЕсли;
		Если ТребуетсяЗаполнение Тогда
			Отбор = Новый Структура("РеквизитыПолноеИмя,", Новый Соответствие);
			Отбор.РеквизитыПолноеИмя.Вставить("СчетУчетаРасчетовСКонтрагентом", Истина);
			Отбор.РеквизитыПолноеИмя.Вставить("СубконтоДт1", Истина);
			Отбор.РеквизитыПолноеИмя.Вставить("СубконтоДт2", Истина);
			Отбор.РеквизитыПолноеИмя.Вставить("СубконтоДт3", Истина);
			Отбор.РеквизитыПолноеИмя.Вставить("ПодразделениеДт", Истина);
			СчетаУчетаВДокументах.Заполнить(ЭтотОбъект, Отбор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли