#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		ЗарплатаКадры.ЗаполнитьПоОснованиюСотрудником(ЭтотОбъект, ДанныеЗаполнения, , Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ДанныеДляПроведения = ПолучитьДанныеДляПроведения();
	
	УчетНДФЛ.СформироватьДоходыНДФЛПоКодамДоходовИзТаблицыЗначений(Движения, Отказ, Организация, ДатаОперации, ДанныеДляПроведения.Доходы, , , Ссылка);
	УчетНДФЛ.СформироватьПредоставленныеИмущественныеВычетыПоВременнойТаблице(Движения, Отказ, Организация, ДатаОперации, ДанныеДляПроведения.МенеджерВременныхТаблиц);
	УчетНДФЛ.СформироватьСтандартныеВычетыПоВременнойТаблице(Движения, Отказ, Организация, ДатаОперации, ДанныеДляПроведения.МенеджерВременныхТаблиц);
	УчетНДФЛ.СформироватьИсчисленныйНалогПоВременнойТаблице(Движения, Отказ, Организация, ДатаОперации, ДанныеДляПроведения.МенеджерВременныхТаблиц);
	Если Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Количество() > 0 Тогда
		УчетНДФЛ.СформироватьДокументыУчтенныеПриРасчетеДляМежрасчетногоДокумента(Движения, Отказ, Организация, Сотрудник, Ссылка); 	
	КонецЕсли;
	УчетНДФЛ.СформироватьИспользованныеАвансовыеПлатежиПоВременнойТаблице(Движения, Отказ, Организация, ДатаОперации, ДанныеДляПроведения.МенеджерВременныхТаблиц);
	УчетНДФЛ.СформироватьУдержанныйНалогПоВременнойТаблице(Движения, Отказ, Организация, ДатаОперации, ДанныеДляПроведения.МенеджерВременныхТаблиц);
	УчетНДФЛ.СформироватьПеречисленныйНалогПоВременнойТаблице(Движения, Отказ, Организация, ДатаОперации, ДанныеДляПроведения.МенеджерВременныхТаблиц);
	
	УчетНДФЛ.СформироватьНДФЛКПеречислению(Движения, Отказ);
	УчетНДФЛ.СформироватьНДФЛПеречисленный(Движения, Отказ);
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РасчетыСБюджетомПоНДФЛ") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетыСБюджетомПоНДФЛ");
		Модуль.РасчетыСБюджетомПоНДФЛЗарегистрироватьНДФЛКПеречислению(Движения, Отказ);
		Модуль.РасчетыСБюджетомПоНДФЛЗарегистрироватьНДФЛПеречисленный(Движения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СведенияОДоходах.Количество() = 0
		И НДФЛИсчисленныйПоСтавке13.Количество() = 0
		И НДФЛУдержанный.Количество() = 0
		И НДФЛПеречисленный.Количество() = 0
		И ПредоставленныеВычеты.Количество() = 0 Тогда
		
		СообщениеОбОшибке = НСтр("ru='Не заполнены табличные части, должна быть заполнена хотя бы одна табличная часть.'");
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке,,,,Отказ);
		
	КонецЕсли;
	
	Для Каждого СтрокаНалога Из НДФЛИсчисленныйПоСтавке13 Цикл
		Если СтрокаНалога.Сумма = 0 И СтрокаНалога.ЗачтеноАвансовыхПлатежей = 0 Тогда
			СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке №%1 не указано ни суммы налога ни суммы зачтенных авансовых платежей.'"), СтрокаНалога.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке,,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаИзмененияПорядкаИсчисленияНалогаДляИностранцев", УчетНДФЛ.ДатаИзмененияПорядкаИсчисленияНалогаДляИностранцев());
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Вычеты.Ссылка.Сотрудник КАК ФизическоеЛицо,
	|	Вычеты.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	Вычеты.ОбособленноеПодразделение КАК Подразделение,
	|	Вычеты.КодВычета КАК КодВычета,
	|	Вычеты.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТДанныеОбИмущественныхВычетах
	|ИЗ
	|	Документ.ОперацияНалоговогоУчетаПоНДФЛ.ПредоставленныеВычеты КАК Вычеты
	|ГДЕ
	|	Вычеты.Ссылка = &Ссылка
	|	И Вычеты.КодВычета.ГруппаВычета В (ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.СоциальныеПоУведомлениюНО), ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.Имущественные))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вычеты.Ссылка.Сотрудник КАК ФизическоеЛицо,
	|	Вычеты.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	Вычеты.ОбособленноеПодразделение КАК Подразделение,
	|	Вычеты.КодВычета КАК КодВычета,
	|	Вычеты.Сумма КАК Сумма,
	|	Вычеты.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	Вычеты.МесяцПериодаПредоставленияВычета КАК МесяцПериодаПредоставленияВычета
	|ПОМЕСТИТЬ ВТДанныеОСтандартныхВычетах
	|ИЗ
	|	Документ.ОперацияНалоговогоУчетаПоНДФЛ.ПредоставленныеВычеты КАК Вычеты
	|ГДЕ
	|	Вычеты.Ссылка = &Ссылка
	|	И НЕ Вычеты.КодВычета.ГруппаВычета В (ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.СоциальныеПоУведомлениюНО), ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.Имущественные))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.Ссылка.Сотрудник КАК ФизическоеЛицо,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.ОбособленноеПодразделение КАК Подразделение,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.КодДохода КАК КодДохода,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.КатегорияДохода КАК КатегорияДохода,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.СуммаДохода КАК СуммаДохода,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.КодВычета КАК КодВычета,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.СуммаВычета КАК СуммаВычета,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.СуммаНалогаИсчисленная КАК СуммаНалогаИсчисленная,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ
	|ПОМЕСТИТЬ ВТСведенияОДоходахПоНДФЛ
	|ИЗ
	|	Документ.ОперацияНалоговогоУчетаПоНДФЛ.СведенияОДоходах КАК ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах
	|ГДЕ
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.Ссылка.Сотрудник КАК ФизическоеЛицо,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.ОбособленноеПодразделение КАК Подразделение,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.Сумма КАК Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13) КАК СтавкаНалогообложенияРезидента,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.ПустаяСсылка) КАК КодДохода,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.КатегорияДохода КАК КатегорияДохода
	|ПОМЕСТИТЬ ВТНДФЛИсчисленный
	|ИЗ
	|	Документ.ОперацияНалоговогоУчетаПоНДФЛ.НДФЛИсчисленныйПоСтавке13 КАК ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13
	|ГДЕ
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.ДатаПолученияДохода < &ДатаИзмененияПорядкаИсчисленияНалогаДляИностранцев
	|			ТОГДА НАЧАЛОПЕРИОДА(ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ)
	|		ИНАЧЕ ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.ДатаПолученияДохода
	|	КОНЕЦ,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.Подразделение,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.СуммаНалогаИсчисленная,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.КодДохода,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.ВключатьВДекларациюПоНалогуНаПрибыль,
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.КатегорияДохода
	|ИЗ
	|	ВТСведенияОДоходахПоНДФЛ КАК ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах
	|ГДЕ
	|	ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|	И ОперацияНалоговогоУчетаПоНДФЛСведенияОДоходах.СуммаНалогаИсчисленная <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.Ссылка.Сотрудник КАК ФизическоеЛицо,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.ОбособленноеПодразделение КАК Подразделение,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.СтавкаНалогообложения КАК СтавкаНалогообложенияРезидента,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.Ставка КАК Ставка,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.Сумма КАК Сумма,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.КодДохода КАК КодДохода,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.КатегорияДохода КАК КатегорияДохода,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.СрокПеречисления КАК СрокПеречисления,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.СуммаВыплаченногоДохода КАК СуммаВыплаченногоДохода,
	|	ВЫБОР
	|		КОГДА ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.ДокументОснование = НЕОПРЕДЕЛЕНО
	|			ТОГДА ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.Ссылка
	|		ИНАЧЕ ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.ДокументОснование
	|	КОНЕЦ КАК ДокументОснование,
	|	ИСТИНА КАК УчитыватьВыплаченныйДоходВ6НДФЛ
	|ПОМЕСТИТЬ ВТНалогУдержанный
	|ИЗ
	|	Документ.ОперацияНалоговогоУчетаПоНДФЛ.НДФЛУдержанный КАК ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный
	|ГДЕ
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛУдержанный.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходахПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходахПоНДФЛ.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	НАЧАЛОПЕРИОДА(СведенияОДоходахПоНДФЛ.ДатаПолученияДохода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	СведенияОДоходахПоНДФЛ.Подразделение КАК Подразделение,
	|	СведенияОДоходахПоНДФЛ.КодДохода КАК КодДохода,
	|	СведенияОДоходахПоНДФЛ.СуммаДохода КАК СуммаДохода,
	|	СведенияОДоходахПоНДФЛ.КодВычета КАК КодВычета,
	|	СведенияОДоходахПоНДФЛ.КатегорияДохода КАК КатегорияДохода,
	|	СведенияОДоходахПоНДФЛ.СуммаВычета КАК СуммаВычета,
	|	СведенияОДоходахПоНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	СведенияОДоходахПоНДФЛ.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ
	|ИЗ
	|	ВТСведенияОДоходахПоНДФЛ КАК СведенияОДоходахПоНДФЛ
	|ГДЕ
	|	(СведенияОДоходахПоНДФЛ.СуммаДохода <> 0
	|			ИЛИ СведенияОДоходахПоНДФЛ.СуммаВычета <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛПеречисленный.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛПеречисленный.Ссылка.Сотрудник КАК ФизическоеЛицо,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛПеречисленный.Ставка КАК Ставка,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛПеречисленный.Сумма КАК Сумма,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛПеречисленный.РеквизитыПлатежногоПоручения КАК РеквизитыПлатежногоПоручения,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛПеречисленный.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛПеречисленный.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛПеречисленный.ИсчисленоПоДивидендам КАК ИсчисленоПоДивидендам
	|ПОМЕСТИТЬ ВТНалогПеречисленный
	|ИЗ
	|	Документ.ОперацияНалоговогоУчетаПоНДФЛ.НДФЛПеречисленный КАК ОперацияНалоговогоУчетаПоНДФЛНДФЛПеречисленный
	|ГДЕ
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛПеречисленный.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.Ссылка.Сотрудник КАК ФизическоеЛицо,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.ОбособленноеПодразделение КАК Подразделение,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.ЗачтеноАвансовыхПлатежей КАК Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13) КАК СтавкаНалогообложенияРезидента,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.КатегорияДохода КАК КатегорияДохода
	|ПОМЕСТИТЬ ВТДанныеОЗачтенныхПлатежах
	|ИЗ
	|	Документ.ОперацияНалоговогоУчетаПоНДФЛ.НДФЛИсчисленныйПоСтавке13 КАК ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13
	|ГДЕ
	|	ОперацияНалоговогоУчетаПоНДФЛНДФЛИсчисленныйПоСтавке13.Ссылка = &Ссылка";
	Результаты = Запрос.ВыполнитьПакет();
	
	Доходы = Результаты[5].Выгрузить();
	
	ДанныеДляПроведения = Новый Структура("Доходы, МенеджерВременныхТаблиц", Доходы, Запрос.МенеджерВременныхТаблиц);
						
	Возврат ДанныеДляПроведения;

КонецФункции

#КонецОбласти

#КонецЕсли
