
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		ИмяФормы = ПараметрыВыполненияКоманды.Источник.ИмяФормы;
		Если ИмяФормы = "Справочник.ОсновныеСредства.Форма.ФормаСписка"
			ИЛИ ИмяФормы = "Справочник.ОсновныеСредства.Форма.ФормаВыбора" Тогда
			ПараметрыФормы.Вставить("НачальныйРодитель", ПараметрыВыполненияКоманды.Источник.Элементы.Список.ТекущийРодитель);
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаГрупповогоСоздания", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
