
#Область ПрограммныйИнтерфейс

// Сообщает, возможно ли формирование комплекта нулевой отчетности в упрощенном режиме
// для переданной организации на указанную дату.
//
// Параметры:
//  Организация  - СправочникСсылка.Организации - проверяемая организация
//  Период       - Дата - дата проверки
//
// Возвращаемое значение:
//   Булево   - Если ИСТИНА, нулевую отчетность можно сформировать в упрощенном режиме.
//
Функция ДоступноУпрощенноеФормирование(Организация, Период) Экспорт
	
	Результат =
		НЕ ТарификацияБПВызовСервераПовтИсп.РазрешенУчетРегулярнойДеятельности()         // Режим сервиса "Нулевка"
		И НЕ ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация)
		И НЕ УчетЗарплаты.ИПИспользуетТрудНаемныхРаботников(Организация)                 // ИП без сотрудников
		И НЕ УчетнаяПолитика.ПлательщикНДФЛЗаПериод(Организация, Дата(1, 1, 1), Период); // Применялась только УСН
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

