
#Область СлужебныйПрограммныйИнтерфейс

Процедура РасширеннаяПодсказкаНажатие(Форма, ИмяПоля, ОписаниеФормыОбъекта = Неопределено) Экспорт
	
	// Заполняем структуру по умолчанию.
	ЗаполнитьОписаниеФормыОбъектаДляОрганизации(ОписаниеФормыОбъекта);
	
	СтруктураОписание = ОписаниеПоИмениЭлемента(ИмяПоля, "РасширеннаяПодсказка");
	ОписаниеФормыОбъекта.ИмяРеквизитаОрганизация = СтруктураОписание.ИмяРеквизитаОрганизация;
	
	ОписаниеПодписи = СтруктураИменРеквизитовПодписанта(Форма, СтруктураОписание.Ключ, ОписаниеФормыОбъекта);
	
	Организация = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(
		Форма, ОписаниеФормыОбъекта.ПрефиксФормыОбъект + ОписаниеФормыОбъекта.ИмяРеквизитаОрганизация);
		
	СтандартнаяОбработка = Истина;
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодписиДокументовОснованияПолномочий") Тогда
		МодульПодписиДокументовОснованияПолномочийКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодписиДокументовОснованияПолномочийКлиент");
		МодульПодписиДокументовОснованияПолномочийКлиент.ОткрытьФормуНастройкиОснованияПодписи(Форма, ИмяПоля, Организация, ОписаниеПодписи, СтандартнаяОбработка);
	КонецЕсли;
	
	Если СтандартнаяОбработка Тогда
		ОткрытьФормуВыбораДолжности(Форма, ИмяПоля, Организация, ОписаниеПодписи);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриИзмененииПодписывающегоЛица(Форма, ИмяЭлемента, ОписаниеФормыОбъекта = Неопределено) Экспорт

	ЗаполнитьОписаниеФормыОбъектаДляОрганизации(ОписаниеФормыОбъекта);
	
	СтруктураОписание = ОписаниеПоИмениЭлемента(ИмяЭлемента);
	ОписаниеФормыОбъекта.ИмяРеквизитаОрганизация = СтруктураОписание.ИмяРеквизитаОрганизация;
	ОписаниеФормыОбъекта.ИмяПосадочнойГруппы = ПодписиДокументовКлиентСервер.ИмяПосадочнойГруппыПоОрганизации(СтруктураОписание.ИмяРеквизитаОрганизация);
	
	Организация = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(
		Форма, ОписаниеФормыОбъекта.ПрефиксФормыОбъект + ОписаниеФормыОбъекта.ИмяРеквизитаОрганизация);
	
	СтруктураОписанияПодписанта = СтруктураИменРеквизитовПодписанта(Форма, СтруктураОписание.Ключ, ОписаниеФормыОбъекта);
	
	ФизическоеЛицо = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, СтруктураОписанияПодписанта.ФизическоеЛицо);
	
	// Заполняем реквизиты формы, связанные с основанием полномочий
	ДанныеФизическогоЛица = ПодписиДокументовВызовСервера.ОснованияПолномочийФизическихЛиц(Организация, ФизическоеЛицо).Получить(ФизическоеЛицо);
	ПодписиДокументовКлиентСервер.ЗаполнитьОснованияПолномочийВФорме(Форма, СтруктураОписанияПодписанта, ДанныеФизическогоЛица);
	
	ПодписиДокументовКлиентСервер.УстановитьПредставлениеПодписей(Форма, ОписаниеФормыОбъекта);
	ПодписиДокументовКлиентСервер.УстановитьЗаголовокГруппеПодписей(Форма, ОписаниеФормыОбъекта);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуВыбораДолжности(Форма, ИмяПоля, Организация, СтруктураОписанияПодписанта)

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("ИмяПоля", ИмяПоля);
	ДополнительныеПараметры.Вставить("Организация", Организация);
	ДополнительныеПараметры.Вставить("ФизическоеЛицо",
		ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, СтруктураОписанияПодписанта.ФизическоеЛицо));
	ДополнительныеПараметры.Вставить("ОписаниеПолей", СтруктураОписанияПодписанта);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбновитьПредставлениеОснованияПодписиВФорме", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока", 
		ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, СтруктураОписанияПодписанта.Должность));
	
	ОткрытьФорму("Справочник.Должности.ФормаВыбора", ПараметрыФормы, Форма, Форма.УникальныйИдентификатор,,, ОповещениеОЗакрытии);

КонецПроцедуры

// Обработчик закрытия формы настройки.
//
Процедура ОбновитьПредставлениеОснованияПодписиВФорме(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено
		Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ИмяПоля = ДополнительныеПараметры.ИмяПоля;
	ОписаниеПолей = ДополнительныеПараметры.ОписаниеПолей;
	
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, ОписаниеПолей.Должность, Результат);
	
	ПодписиДокументовКлиентСервер.УстановитьПредставлениеПодписи(Форма, ИмяПоля, ОписаниеПолей);  
	
	ПодписиДокументовВызовСервера.ЗаписатьОснованияПолномочийОтветственныхЛиц(
		ДополнительныеПараметры.Организация,
		ДополнительныеПараметры.ФизическоеЛицо,
		"",
		Результат);
		
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьОписаниеФормыОбъектаДляОрганизации(ОписаниеФормыОбъекта = Неопределено)

	Если ОписаниеФормыОбъекта = Неопределено Тогда
		ОписаниеФормыОбъекта = ПодписиДокументовКлиентСервер.ОписаниеФормыОбъектаДляОрганизацииПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеПоИмениЭлемента(ИмяЭлементаФормы, Постфикс = "")
	
	Описание = Новый Структура(
		"Ключ, 
		|ИмяРеквизитаОрганизация");
	
	Позиция = СтрНайти(ИмяЭлементаФормы, "Подписи") - 1;
	
	ИмяКлюча = Прав(ИмяЭлементаФормы, СтрДлина(ИмяЭлементаФормы) - (Позиция + 7));
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ИмяКлюча = СтрЗаменить(ИмяКлюча, Постфикс, "");
	КонецЕсли;
	
	Описание.Ключ = ИмяКлюча;
	Описание.ИмяРеквизитаОрганизация = Лев(ИмяЭлементаФормы, Позиция);
	
	Возврат Описание;
	
КонецФункции

Функция СтруктураИменРеквизитовПодписанта(Форма, РольПодписанта, ОписаниеФормыОбъекта)

	ОписаниеПолейПодписантов = ПодписиДокументовКлиентСервер.СоответствиеОписанийПодписейДокументаДляОрганизации(Форма, ОписаниеФормыОбъекта);
	Возврат ОписаниеПолейПодписантов.Получить(РольПодписанта);

КонецФункции

#КонецОбласти